{"id":1604,"date":"2012-07-25T14:40:44","date_gmt":"2012-07-25T14:40:44","guid":{"rendered":"https:\/\/niftymarketing.com\/?p=1604"},"modified":"2018-04-05T17:51:30","modified_gmt":"2018-04-05T17:51:30","slug":"your-unique-selling-proposition","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/","title":{"rendered":"Your Unique Selling Proposition (USP): What makes you different than the rest?"},"content":{"rendered":"<h1>Your Unique Selling Proposition (USP): What makes you different than the rest?<\/h1>\n<p>To say that I’ve rewritten this blog post is an understatement. Just to give you an idea, here’s an easy to follow, point-by-point, list of changes I’ve made before I decided upon the final format. (Please, read on, there is a point in all of this).<\/p>\n<ol>\n<li>Romeo vs Edward: How to get conversions by changing your content message.<\/li>\n<li>10 content tricks Google doesn’t want you to know that will triple your conversions.<\/li>\n<li>5 actionable, conversion increasing, content changes that you can make right now.<\/li>\n<li>The single most important content change you can make to increase conversions<\/li>\n<li>Defining a new field: Unique Content Conversion Optimization; or how I stopped fighting and learned to love Unique Content<\/li>\n<\/ol>\n<p>As I spent my time developing each of these ideas into blog posts, I found that I was talking about one every specific thing: A systematic approach to discovering who you are as a business and why a client\/customer would want to convert to your truth instead of a competitors. And as I revised and rewrote and revised and rewrote, I remembered something that my Love, Sex, and Marriage in the Middle Ages (yes, it was an incredibly interesting class…) professor taught me about writing essays: “Don’t decide whose guilty before you look for clues”. What she meant was that a detective doesn’t decided who’s guilty before he reaches the crime scene, so don’t write a thesis before you gather the facts.<\/p>\n<p><img src=\"http:\/\/www.thebreman.org\/exhibitions\/online\/1000kids\/PersecutedJews.jpg\" alt=\"\" \/><br \/>\n<small>They had some pretty weird ideas in the Middle Ages.<\/small><\/p>\n<p>I believe the same holds true for unique content and your USP. I will grant you that you undoubtedly know more about your business than I did about medieval attitudes towards the Jewish living in England, however, that doesn’t mean that you know your USP without thinking about it.<\/p>\n<p>And when it comes to getting conversions, nothing will do better, cost less money, or bring everything together like a Unique Selling Proposition. Let me give you a case study that I’ve seen with one of our own clients. (Names are omitted to protect the innocent, and all that jazz).<\/p>\n<h2>Case Study #1: Pest Control<\/h2>\n<p>We recently did a redesign for a pest company. This company’s old content was the same old “We offer satisfaction guaranteed!” and the normal corporate speak that every website everywhere has. So when the client told me that I had free reign on unique content (as their old site was mainly copied and duped), I leaped at the chance to create something unique for them. Now, I had a head start as our head designer had already come up with the idea for hating bugs in his design. I tweaked the tagline a little to read, “Yeah, We Hate ‘em too” and I ran with that.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-1605\" title=\"Pest Control\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/3822256_129223129_7568825-300x178.png\" alt=\"\" width=\"300\" height=\"178\" \/><\/p>\n<p>What I was able to create for them was a USP of them hating these pests so much that they were willing to give coupons for free services and send out pest assassins to rid their client’s homes of invaders. What this approach allows them to do is three-fold:<\/p>\n<ol>\n<li>Establish a problem that clients can connect to on an emotional level (fear). The “Yeah, We Hate ‘em too” does a brilliant job of creating an emotional bridge between the company and the client. Just a couple of notes here:\n<ul>\n<li>The message is in quotes, making the client think that they are part of the conversion. Stats show that if you put something in quotes, people are 60% more likely to read it.<\/li>\n<li>By starting with “yeah” the company is replying to something just said by the client; which can only be “I hate (insert whatever brand of creepy crawly they happen to be dealing with at the moment)”. This is awesome because the company never actually states which bugs they hate specifically, so if the client comes to the website because of spiders or ants or wasps or termites, the headline still connects with them.<\/li>\n<li>The client has the stress and pressure of not knowing everything about the industry removed by the colloquial “’em”. Using contractions and turn of phrases puts the client at ease which helps make the emotional connection.<\/li>\n<li>The client now has made an emotional connection based on common ground with the company. All with just 5 little words.<\/li>\n<\/ul>\n<\/li>\n<li>Present a solution to that problem where the only logical choice for the client is to choose them as their pest control company by subsiding their fear without demeaning them for having that fear.<\/li>\n<li>The continued messaging of “we hate ‘em” through out the site gives the client the feeling that the company is not just trying to win them over on the home page but rather really does feel the same way as them about bugs.<\/li>\n<\/ol>\n<p>So what happened to this client’s conversions? Three minutes after the new design went live on their site, they got a form fill. Then another. And another. The site has only been live for a month, but already there have been more than double the amount of conversions than the old site had.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/Screen-shot-2012-07-24-at-2.09.03-PM-1024x293.png\" alt=\"\" title=\"Screen shot 2012-07-24 at 2.09.03 PM\" width=\"1024\" height=\"293\" class=\"aligncenter size-large wp-image-1659\" \/><\/p>\n<p>I’m not naïve or prideful enough to think that it was only my content work that got them that much of an increase. There were many factors, including a great looking design by our head designer. It could be that we are entering their busy session. However, all of these things aside, I have seen time and time again where carefully crafted content can triple conversions. Still don’t believe me? Here’s another case study for you.<\/p>\n<h2>Case Study #2: Personal Injury Lawyer<\/h2>\n<p>We recently launched a new design for a law client. At that time, I wasn’t focused on content strategy (I’m fairly young in the industry, so I spent a lot of time getting to know SEO and all related fields before I picked a focus), so we launched the site without much of a USP. I decided a few weeks ago to tweak the content a little to see if it would change anything. Here’s the original design versus what I did:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-1638\" title=\"changes\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/changes.jpg\" alt=\"\" width=\"500\" height=\"500\" \/><\/p>\n<ol>\n<li>I moved the form to the bottom of page instead of having it be on the first screen.<\/li>\n<li>I answer the question right of the bat; Here is how we are different. Why? Because whether they are actually thinking it or it&#8217;s floating in the back of their mind, visitors are asking, how are you different from that other guy? Answering that question out-right removes that hurdle.<\/li>\n<li>I stuggled for a long time of the wording for the next bit. I wanted to put client stories on the front (because their USP is that they will connect with their client, call them by their first name, etc) to provide a sense of community to the visitor. However, when I first wrote the content I called them Success Stories. After much laboring of thought (done mostly in the wee hours of the morning), I decided these weren&#8217;t success stories. One client lost both his arms to a wood chipper; how do you call that success? No matter the amount of money they got from the case, I couldn&#8217;t see it as a success. So I settled on just plain stories. I&#8217;m glad I did.<\/li>\n<\/ol>\n<p>Here&#8217;s the numbers from their analytics account:<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/Screen-shot-2012-07-24-at-2.05.36-PM-1024x308.png\" alt=\"\" title=\"Screen shot 2012-07-24 at 2.05.36 PM\" width=\"1024\" height=\"308\" class=\"aligncenter size-large wp-image-1658\" \/><\/p>\n<p>These changes have only been live for two weeks. So I&#8217;m showing you the two weeks prior to the changes and then the data for the changes I made. This client went from a 2.78% conversion rate to a 4.92% conversion. That&#8217;s almost double the rate. I should mention that I have been struggling daily with this client to get their conversion rate above 2%, so I was fairly scared to try this new approach (because it is so different from anything we&#8217;ve done, or seen done, on a lawyers site). I&#8217;m very interested in seeing if that 4.92% stays the same over the next few weeks. Either way, I&#8217;ll be tweaking things to get it even higher.<\/p>\n<h2>What I&#8217;ve Learned<\/h2>\n<p>So, if I had to sum up the things that I have learned in the last six months focusing on Content, it would come down to the following things:<\/p>\n<ol>\n<li><strong>Test.<\/strong> Just as you would test design, call-to-actions, layout, etc, content does better when refined through testing. Making small changes to wording, voice, tone, can have a huge impact on the way that people interact with your website.<\/li>\n<li><strong>Talk softly but carry a big wallop in your pocket.<\/strong> If you stop and think about your Unique Selling Proposition for a second, you’ll realize it has a huge impact on everything you do. So whether you go with a loud approach (like <a href=\"http:\/\/outspokenmedia.com\/\">Outspoken Media<\/a>, who broadcasts their uniqueness through cleverly worded copy and “outspoken” statements) or a more subtle humour approach (like <a href=\"http:\/\/avalaunchmedia.com\/\">Avalaunch Media<\/a>, whose copy makes you laugh while still focusing on the their results), you need a “bam” factor in your copy. Your USP should drive customers to fill out forms, make phone calls, add things to their basket, etc.<\/li>\n<li><strong>Certain words have more affect than others.<\/strong> For example, our law client’s site said, “We only represent victims of personal injury”. There are a couple of things wrong with this sentence. It’s limiting. If someone doesn’t understand that a wrongful death, or medical malpractice, or sexual abuse, is considered a personal injury, they wouldn’t contact our lawyer. It also sounds like a statement of fact, rather than an inviting call-to-action. The layperson reading their site would read it and say to themselves, “Yeah. Ok. I get that.” And then not do anything. Changing it to, “We specialize in representing victims of all types of personal injury” removes the limiting nature of “only” while still saying that is their focus. It also is more inviting because it leaves a little bit of wonder in the reader’s mind. What other types of personal injury are there?<\/li>\n<li><strong>Writing quality, converting content takes a lot of research, testing, and, most distressingly, time.<\/strong> I was the kind of Lit Major who would write one draft in an hour, and then edit for twenty minutes and call my essay done. And while I always got As (sorry if that sounds bragging, there is a point), my teachers would also tell me my essays could be so much better. So, one day, I wrote one draft, then another, and another, until I had gone through 15 drafts and about 20 hours writing one essay. It won me the understanding English major award at my university. The lesson: I never again wrote an essay in an hour. It’s the same with content. Yes, it can be done in twenty minutes but the benefits of taking your time and revising what you write, will directly correlate to the quantity and, more importantly, the quality of conversions you see.<\/li>\n<li><strong>Have fun.<\/strong> Writing is about expression, conveying messages, helping others understand what you do and how it can help them. Have fun with it. No one knows you better then yourself and when it comes to content, the more you express yourself the more customers\/clients will connect with you instead of your competitor.<\/li>\n<\/ol>\n<p>What this all boils down to is having the confidence to break away from the safe and overused corporate speak that adorns so many websites and spending the time to create something unique.<\/p>\n<h2>Four Steps to Create Your Unique Selling Proposition<\/h2>\n<p>So, once you decide that you want to be unique in a world full of copycats, how do you go about answering the question, “How am I different from my competitors?”<\/p>\n<p>Fair enough. Let me give you four easy steps.<\/p>\n<h4>Step 1 – Brainstorm.<\/h4>\n<p><img loading=\"lazy\" alt=\"\" src=\"http:\/\/earnestmedia.files.wordpress.com\/2011\/11\/brainstorming.gif?w=604\" title=\"USP\" class=\"alignnone\" width=\"450\" height=\"454\" \/><\/p>\n<p>Your USP isn’t something that you can pound out over a lunch break. There are certain things to consider, ideas that need time to grow, etc. I’m not saying that you should take 6 months to develop your USP but understanding that it will take time is key to creating something amazing. The easiest way to start brainstorming your USP is by thinking in terms of Achieve-Be-Do (some of you might recognize these steps from Content Strategy for the Web; albeit, I&#8217;ve adapted it for my own needs here).<\/p>\n<ul>\n<li>Achieve: What do you want to achieve? Now, don’t say more sales. That’s like saying I want to be rich when I’m older. You need a specific goal. One of our clients wants 12 customers a day in his shop. Awesome. That’s something we can measure against and work toward.<\/li>\n<li>Be: What type of company will you be? This is a hard one because you limit yourself here. You have to pick which emotion you will create content around. Be it fear, greed, vanity, or exclusivity (the four emotions that all great content boils down to), you need to determine which will be best for you and the service\/product your selling.<\/li>\n<li>Do: This is where you determine how you will do what you set out to achieve. Will it be through social media? Through specifically targeted landing pages? Perhaps you want to create infographics to show with words what your company is all about.<\/li>\n<\/ul>\n<h4>Step 2 – Write down the general idea.<\/h4>\n<p><img loading=\"lazy\" class=\"aligncenter\" title=\"Quill Writing\" src=\"http:\/\/www.quill-pen.info\/wp-content\/uploads\/2012\/03\/lhertzel_1303424945_quill-pen.jpg\" alt=\"\" width=\"320\" height=\"240\" \/><\/p>\n<p>This is where most companies stop. They write down the general “We offer better-than-average service” blob of content and let it sit without breathing life into it. And while this step is incredibly important, it’s not what creates the magic of your USP.<\/p>\n<h4>Step 3 – Revise.<\/h4>\n<p><img loading=\"lazy\" class=\"aligncenter\" title=\"Revise\" src=\"http:\/\/www.lapsura.com\/drawings\/archives\/images\/revise-them.jpg\" alt=\"\" width=\"653\" height=\"392\" \/><\/p>\n<p>Nothing will help your content more then revising what you’ve written. To give you an idea, here’s a quick example from a famous Elvis song. The writers, Tommy Durden and Mae Boren Axton, were inspired to write “Heartbreak Hotel” when Tommy found a story in the local newspaper about a man who committed suicide, who left “I walk a lonely street” as his goodbye note. This is was the first draft:<\/p>\n<p>“Since my baby left me I’ve got a new place to dwell<br \/>\nI walk down a lonely street to Heartbreak Hotel.”<\/p>\n<p>After much revision, they finally landed on the finished song, which has so much more depth and feeling then the first draft could portray:<\/p>\n<p>“Since my baby left me I found a new place to dwell<br \/>\nDown at the end of ‘Lonely Street’ to ‘Heartbreak Hotel.’”<\/p>\n<p>You should continue to revise your content until you are happy with the results it is giving you. There may be times where, after 4 or 5 revisions, you hit the mark and see major improvement. Other times it may take 20 or 50 revisions before you see improvement. To repurpose a famous movie tagline, “If you revise it, they will convert.”<\/p>\n<p>And there is nothing more thrilling than finally writing that perfect combination of words that strike your customers to the bone and fill them with breathless delight for your brand.<\/p>\n<h4>Step 4 – Test.<\/h4>\n<p><img loading=\"lazy\" class=\"aligncenter\" title=\"Testing\" src=\"http:\/\/www.psychotactics.com\/blog\/wp-content\/uploads\/2008\/07\/i11.jpg\" alt=\"\" width=\"400\" height=\"283\" \/><\/p>\n<p>I said it before but I’ll restate it here for clarity. You need to test everything you go. Develop goals and benchmarks to test against and measure how your content is performing. There have been times that I’ve said, “This is the most awesome thing I have ever done” and, if it converted anyone, they were ghosts haunting the static in my cell phone. Always test. Don’t take anything for granted.<\/p>\n<h2>Parting is Such Sweet Sorrow<\/h2>\n<p>As a parting gift, I want to give examples of content I feel achieves that lofty goal of converting customers to your brand. Each of these examples has converted me solely based on the quality and uniqueness of their content.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/Printfection-Screenshot-300x227.png\" alt=\"\" title=\"Printfection Screenshot\" width=\"300\" height=\"227\" class=\"aligncenter size-medium wp-image-1655\" \/><br \/>\n<a href=\"http:\/\/www.printfection.com\">http:\/\/www.printfection.com<\/a><\/p>\n<p>The thing I love about this site is that they rock at addressing my needs from the front page. Who doesn’t want to “swagify” their brand? They do an excellent job of marketing to personas with their slider (I’d love to hear who you think their personas are in the comments). And the whole site just has a relaxed, no pressure feel to it. Every word of content makes me feel safe, that I can trust them, and that “Try Printfection Now, Completely Free” button just begged me to push it. So now I have a custom mouse pad on the way that will make everyone in my office jealous.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/freshnotcanned-screen-shot-300x175.png\" alt=\"\" title=\"freshnotcanned screen shot\" width=\"300\" height=\"175\" class=\"aligncenter size-medium wp-image-1654\" \/><br \/>\n<a href=\"http:\/\/www.freshnotcanned.com\/\">http:\/\/www.freshnotcanned.com\/<\/a><\/p>\n<p>I will concede that at first glance this site looks fairly simple. There’s nothing that screams click me, there’s little content on the homepage, but then you click the process page and BAM you’re hit with a unique voice that seems to leap off the page and assault you with friendliness. They use emotional words in such a way that before you know it you’re picking up the phone and calling them because you truly believe it will make you happy to talk to these people. It is seriously genius the way they have sprinkled those emotional sells through out their copy.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2012\/07\/Davids-Tea-screen-shot-300x215.png\" alt=\"\" title=\"David&#039;s Tea screen shot\" width=\"300\" height=\"215\" class=\"aligncenter size-medium wp-image-1653\" \/><br \/>\n<a href=\"http:\/\/www.davidstea.com\/\">http:\/\/www.davidstea.com\/<\/a><\/p>\n<p>I have a confession to make. Some people are addicted to drugs, porn, gambling, etc. There are places for them to get help. They can surround themselves with people who suffer from the same addiction they do, strengthening each other and helping each other take a stand. Well, I have an addiction as well (no, its not Tea, but close). I am addicted to the content on this website. I spend hours of my free time pouring over the descriptions of their tea, indulging in the freshness of their words, cozying up to the warmth portrayed in their sentences, letting the stress of the day drift away as the sheer uniqueness of their paragraphs massages my tired brain cells. And, dear reader, I’m sorry. I’m sorry because now that I’ve shared this site with you, you will become addicted as well.<\/p>\n<p>I purpose a UCA (Unique-Content-aholics Anonymous) meeting on twitter every Friday (Hashtag: #UniqueContent).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your Unique Selling Proposition (USP): What makes you different than the rest? To say that I’ve rewritten this blog post is an understatement. Just to give you an idea, here’s an easy to follow, point-by-point, list of changes I’ve made before I decided upon the final format. (Please, read on, there is a point in &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Your Unique Selling Proposition (USP): What makes you different than the rest?&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":1666,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[53],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Your Unique Selling Proposition (USP): What makes you different than the rest? - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Your Unique Selling Proposition (USP): What makes you different than the rest? - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"Your Unique Selling Proposition (USP): What makes you different than the rest? To say that I’ve rewritten this blog post is an understatement. Just to give you an idea, here’s an easy to follow, point-by-point, list of changes I’ve made before I decided upon the final format. (Please, read on, there is a point in &hellip; Continue reading &quot;Your Unique Selling Proposition (USP): What makes you different than the rest?&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2012-07-25T14:40:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-04-05T17:51:30+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"NiftyAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/\",\"name\":\"Your Unique Selling Proposition (USP): What makes you different than the rest? - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#primaryimage\"},\"datePublished\":\"2012-07-25T14:40:44+00:00\",\"dateModified\":\"2018-04-05T17:51:30+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Your Unique Selling Proposition (USP): What makes you different than the rest?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\",\"name\":\"NiftyAdmin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"caption\":\"NiftyAdmin\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Your Unique Selling Proposition (USP): What makes you different than the rest? - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/","og_locale":"en_US","og_type":"article","og_title":"Your Unique Selling Proposition (USP): What makes you different than the rest? - Nifty Marketing","og_description":"Your Unique Selling Proposition (USP): What makes you different than the rest? To say that I’ve rewritten this blog post is an understatement. Just to give you an idea, here’s an easy to follow, point-by-point, list of changes I’ve made before I decided upon the final format. (Please, read on, there is a point in &hellip; Continue reading \"Your Unique Selling Proposition (USP): What makes you different than the rest?\"","og_url":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2012-07-25T14:40:44+00:00","article_modified_time":"2018-04-05T17:51:30+00:00","twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"NiftyAdmin","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#webpage","url":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/","name":"Your Unique Selling Proposition (USP): What makes you different than the rest? - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#primaryimage"},"datePublished":"2012-07-25T14:40:44+00:00","dateModified":"2018-04-05T17:51:30+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/your-unique-selling-proposition\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/your-unique-selling-proposition\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"Your Unique Selling Proposition (USP): What makes you different than the rest?"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06","name":"NiftyAdmin","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","caption":"NiftyAdmin"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/1604"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=1604"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/1604\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media\/1666"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=1604"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=1604"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=1604"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}