{"id":4530,"date":"2014-04-21T00:00:00","date_gmt":"2014-04-21T00:00:00","guid":{"rendered":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/"},"modified":"2019-11-26T15:24:18","modified_gmt":"2019-11-26T15:24:18","slug":"the-new-rules-of-link-building-for-lawyers","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/","title":{"rendered":"The New Rules of Link Building For Lawyers"},"content":{"rendered":"<p><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg\"><img class=\"aligncenter size-full wp-image-568\" style=\"margin: 0px 30px 0px 00px;width: 100%;\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg\" alt=\"NO Link Building\" width=\"width: 100%;\" \/><\/a>So you want to rank highly for a competitive term in your niche. You’ve probably already figured out that this isn’t going to happen without a fair amount of links pointing back to your site. So how do you gain links without doing something that could eventually get you <a href=\"https:\/\/niftymarketing.com\/services\/penalty-recovery-for-attorneys\/\" target=\"_blank\" rel=\"noopener noreferrer\">penalized<\/a>. The short answer is: you don’t. The slightly longer, better answer is: stop chasing Google’s algorithm. If you really want to rank, stop trying so hard to improve your rankings &amp; create a <a href=\"https:\/\/niftymarketing.com\/services\/legal-content-strategy\/\" target=\"_blank\" rel=\"noopener noreferrer\">content strategy<\/a> that will lead to better traffic and more brand awareness. You need to focus on getting exposure for your linkable content assets. Here are three rules to keep in mind while you are building your brand.<\/p>\n<h2>Rule #1: Link Sorcery Gets Penalized<\/h2>\n<p>Cheap links are a thing of the past. Anything that is cheap is only cheap <i>because it is scalable<\/i>. The days of scalable link building, or link sorcery, are over.<\/p>\n<div style=\"float: right;\"><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/WitchHunt.jpg\"><img loading=\"lazy\" class=\"alignleft size-medium wp-image-2915\" style=\"margin: 0px 10px 0px 10px;\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/WitchHunt-300x219.jpg\" alt=\"Link Sorcery\" width=\"300\" height=\"219\" \/><\/a><\/div>\n<p>It’s becoming less &amp; less worthwhile to actively build links for the sake of links. Google is continually busting out the pitchforks &amp; torches on their witch-hunt for spam link builders. If you’ve been accused of link sorcery by the algorithm, you will be thrown out in the frigid water with the penguins to see if you can swim. Good luck making it back to land with your dignity (rankings). Being affected by a penguin filter can be tricky to recognize &#038; remove because you may not see changes until the next penguin update. It will also require acquiring new links to get ranking positions back to where there were before being affected.<br \/>\n<br \/>\nIf you’ve been found guilty of link sorcery by the spam team, you will be manually punished. You then get to enjoy the fiery hell of link removals &#038; reconsideration requests (rinse and repeat ad nauseam) to try and appease the Google spam gods. A manual penalty will have to be reviewed by a human moderator on the Google spam team. They can be fairly harsh in their decision of whether or not to lift your penalty &#038; allow your site to come back from the dead.<br \/>\n<br \/>\nWe know the <a title=\"Importance of links\" href=\"http:\/\/www.youtube.com\/watch?v=NCY30WhI2og\/\" target=\"_blank\" rel=\"noopener noreferrer\">importance of links<\/a> for <a href=\"https:\/\/niftymarketing.com\/services\/legal-seo-services\/\" target=\"_blank rel=\"noopener noreferrer\">SEO<\/a> isn’t going away any time soon but what can you “safely” do to build links to your site? The term “Link Building” itself has almost become an <a href=\"http:\/\/moz.com\/blog\/7-reasons-to-remove-link-building-from-vocabulary\/\" target=\"_blank\" rel=\"noopener noreferrer\">industry swear word<\/a>; it&#8217;s best to think in terms of “Link Attraction” instead. You want to be building awesome resources, content, tools, etc. to attract links naturally. Does that mean you can’t poke &#038; prod a little to help speed the “attraction” process up? I actually wouldn’t be surprised if Google eventually says “don’t ever ask anyone to link to you with a do-follow link for any reason”. That time hasn’t come yet and even if it does, Google may have a hard time tracking your efforts to make people aware of high quality resources you have on your site.<br \/>\n<br \/>\nGoogle is constantly trying to get business owners to <a href=\"http:\/\/youtu.be\/421aTJI2Nxc?t=1m45s\" target=\"_blank\" rel=\"noopener noreferrer\">forget about “building links” <\/a>and instead encourages businesses to do things online that more closely resemble the things they would do offline. In other words, build awesome content, then make people aware of it in the legal space, related industries &amp; locally. This is more like PR work than link building. Obviously you aren’t going to put money into offline PR work with industries &amp; people that don’t matter to your business so why bother with it online? If you can’t imagine having a link from a site that you wouldn’t want talking about your business in the offline world, you may want to rethink trying to get that link.<br \/>\n<br \/>\nNot only do you need to be careful about the type of site you attempt to get to link to you for the sake of Google’s scrutiny but why put the time, energy, &#038; money into attempting to gain links from a another site that would never send someone to your site who might actually be (or become) a qualified lead or at the very least, build your credibility by having the mention on that site whether that be an individuals blog, business or some other type of entity (e.g.: government agency).<br \/>\n<br \/>\nFocusing on getting authoritative, local &#038; law related sites linking to &#038; talking about you will keep you out of the <a href=\"https:\/\/support.google.com\/webmasters\/answer\/66356?hl=en\" target=\"_blank\" rel=\"noopener noreferrer\">link scheme<\/a> mindset.<\/p>\n<h2>Rule #2: Don’t Chase The Algorithm<\/h2>\n<div style=\"float: left;\"><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/Chasing-The-Algorithm.jpg\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-2914\" style=\"margin: 0px 10px 0px 10px;\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/Chasing-The-Algorithm.jpg\" alt=\"Chasing The Algorithm\" width=\"294\" height=\"260\" \/><\/a><\/div>\n<p>If people in your legal firm are still talking about link building as a strategy strictly to improve ranking positions, it’s risky business. You have the wrong mindset. The first thing you need to do is stop focusing on trying to rank and start thinking more about being awesome. I know, I know, that is an extremely professional &#038; technical suggestion. But let’s examine that thought a little more. You’ve heard the saying: “if you do what you’ve always done you’ll get what you’ve always gotten”. Well guess what, if you do what everyone else is doing, you will get what they have already “gotten”. Which is manual penalties &#038; penguin filters. I already know what you are thinking: you’ve seen the guy that wasn’t ranking a year ago suddenly come out of nowhere to a #1 position for that term you want badly to rank for. Now you’re thinking maybe you should just do what he is doing, even if it is risky. <i>It worked for him so why not us?<\/i>. <i><br \/>\n<\/i><\/p>\n<h4>Here’s a couple of the problems with that mentality:<\/h4>\n<h4>1. You don’t know how much money they’ve spent to build into that position.<\/h4>\n<p>If the tactics employed catch up to him &amp; it results in a penalty 3-6 months down the road, will it be worth it? Remember that it may take 6-12 months or <a href=\"http:\/\/inagist.com\/all\/444223411938541568\/\" target=\"_blank\" rel=\"noopener noreferrer\">longer to recover from a penalty<\/a> once you’re on the boat. I talked to a lot of people that think just because someone is outranking them with risky and\/or spammy tactics that they aren’t spending much money or putting very many resources into it. It is very likely that the competitor outranking you with these tactics is spending just as much or more money than you are &amp; taking a huge gamble at the same time.<\/p>\n<h4>2. Do you want to put your resources into building something that will crash &amp; burn over &amp; over again?<\/h4>\n<p>You can either let the site totally burn to the ground &amp; start over with a new site or you can “repair” the site by trying to get it out of a penalty. Neither one of these options are “quick wins”. Penalty work is not fast, cheap or easy. It requires sorting through hundreds (usually thousands) of links, deciding what is worth keeping and taking a hatchet to the rest. If you are under an algorithm penalty (Penguin) then you won’t need to remove links but you will have to wait to see improvements &amp; you <a href=\"http:\/\/sugarrae.com\/online-marketing\/seo\/understand-about-google-penguin-recovery\/\" target=\"_blank\" rel=\"noopener noreferrer\">won’t pop right back up<\/a> to where you were before before you got hit. If it’s a manual penalty you will have to do all that plus remove links you don’t control by sending out link removal requests, documenting your efforts, asking Google for forgiveness, waiting for a response &#038; most likely, rinse &#038; repeat (potentially multiple times).<br \/>\n<br \/>\nThe problem with letting the site burn to the ground is two-fold. First of all, how long do you think it is going to take to get a brand new site ranking for a competitive term? Well, how long have you been working at it &#038; still struggling to get there? How about your competitors? Just because you didn’t notice the #1 guys site before he started ranking doesn’t mean he wasn’t working at it for months or years to get his site into that position. Secondly, unless you want to really start from scratch completely, with brand new content (no 301ing pages that may still be ranking for some terms, etc.), then there is a chance the penalty may transfer over to the new site. Google’s <a href=\"http:\/\/searchengineland.com\/hiding-google-penalty-may-find-new-home-185353\" target=\"_blank\" rel=\"noopener noreferrer\">penalty may just hunt you down<\/a> to your site’s new home and prevent you from escaping their wrath.<\/p>\n<h2>Rule #3: Do Things To Attract Links That Do More Than Attract Links.<\/h2>\n<div style=\"float: right;\"><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/First-Rule.jpg\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-2913\" style=\"margin: 0px 10px 0px 10px;\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/First-Rule-300x211.jpg\" alt=\"New Rules of Link Building\" width=\"300\" height=\"211\" \/><\/a><\/div>\n<p>So let’s recap. The first rule of link building is: Don’t talk about link building. The second rule is: Don’t talk about link building. No really, if you are building links, you would be better off to just not talk about it (Google might hear you). Start talking about &#038; coming up with new ideas for creating awesome content (in one form or another) that people can actually use &#038; is related to your niche of law. The process looks something like this:<br \/>\n<strong>Step 1:<\/strong> <i>Build Awesome Content (This is where a <a href=\"http:\/\/www.audiencebloom.com\/2013\/04\/how-to-build-a-kickass-content-strategy\/\" target=\"_blank\" rel=\"noopener noreferrer\">great content strategy<\/a> comes into play)<\/i><br \/>\n<strong>Step 3:<\/strong> <i>Profit.<\/i><br \/>\nOh yes, there is one more part of that. This is where the PR work comes in:<br \/>\n<strong>Step 2:<\/strong> <i>Let people know about your awesome content!!<\/i><br \/>\nYou can create the greatest blog post, tool, curated list, infographic, data visualization, etc. in the world but if nobody knows about it, it won’t provide one ounce of value to you or your audience. This is a lot like traditional PR work, just online. You need to let the world know about your contribution to the interwebs. Forgetting this step is the same thing that kills a lot of businesses offline. The classic example applies: A new business owner is passionate about getting that space downtown &#038; starting their very own business. They get the prime real estate, open the door &#038; wait. Then they wait some more. Meanwhile the overhead &#038; rent kill them while they wait for customers to magically walk through the door. Then they wonder why they “just couldn’t make it work”. They never had a strategy, they never advertised, didn’t put a sign up, didn’t have a website, etc. etc. Nobody knew they existed.<br \/>\n<br \/>\nIt’s not just about “location, location, location”. Location is one marketing tactic.<br \/>\nIt can be a strong one but if you don’t have other marketing tactics &#038; a strategy, you might as well give up before you even start. It’s the same online. Don’t think that your coveted #1 keyword position (location) is the end-all be-all. You’ve got to kill more than one bird with your stones. The only way to do that is through carefully planning, executing a content strategy, &#038; then reaching out to members of your target audience (or closely related groups &#038; authoritative sources that can also benefit from your content). Let them know about it. Focus your efforts into projects that can get new traffic to your site, attract links and gain brand awareness all at the same time. It very well may lead to that coveted #1 position at the same time but if it doesn’t, you’re still gaining new, relevant traffic, brand awareness (both of which will lead to conversions) and building the authority of your site in a way that doesn’t require you to repeatedly bet the farm. Keep doing this &#038; you will see your ranking climb but it won’t be the focus anymore, nor will you care nearly as much about it because it will be a byproduct of the real goal: growth.<br \/>\n<br \/>\nIt doesn’t matter what you are doing &amp; how acceptable it may be deemed now, if it can be manufactured into a <a href=\"http:\/\/www.mattcutts.com\/blog\/guest-blogging\/\" target=\"_blank\" rel=\"noopener noreferrer\">scalable process<\/a>, there is a very good chance that Google will eventually come down on process &amp; resort to penalizing algorithmically and\/or manually, the same way they did with <a href=\"http:\/\/www.seroundtable.com\/google-guest-blog-penalty-18278.html\" target=\"_blank\" rel=\"noopener noreferrer\">guest blogging<\/a> recently.<br \/>\n<iframe width=\"560\" height=\"315\" data-url=\"https:\/\/www.youtube.com\/embed\/qozPhALuQQw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe><br \/>\nIn the video above, Cutts, is answering a question specifically about guest blogging but as you will notice, he’s not just talking about guest blogging. He’s hinting at the decline of any method of link acquisition that doesn’t require relevancy, making it “low quality” for the acquiring party. Which is what will happen when you are only focused on gaining links for ranking position.<\/p>\n<h3>What Can You Do Now?<\/h3>\n<p>To sum things up, it doesn’t matter what is or isn’t being said now (in the industry and by Google themselves) about a particular practice or method when it comes to gaining links. Once a method gets abused, action will be taken. We’ve seen Google update their definitions of what is acceptable over &amp; over again as things <a href=\"http:\/\/searchenginewatch.com\/article\/2285276\/Google-Revises-Link-Scheme-Definitions-Guest-Posts-Press-Releases-Advertorials-Can-Hurt-Rankings\" target=\"_blank\" rel=\"noopener noreferrer\">get manipulated<\/a>. The things that are going to work long term are the things that are hard to scale &amp; make sense for more reasons than increasing ranking positions.<br \/>\n<br \/>\nThere’s still a lot space for attorneys to add value to the internet &amp; gain traction in the process. Start with regularly adding epic content to your blog. If you want to write an occasional guest post, do it to build audience\/authority &amp; not just to gain a link. A <a href=\"http:\/\/lawandthemultiverse.com\/2013\/11\/25\/guest-post-defending-loki\/\" target=\"_blank\" rel=\"noopener noreferrer\">great blog post<\/a> can get in front of a lot of eyes, generate comments, shares, etc. &amp; ultimately go a long way. Even though you do have to be careful on how you gain links from <a href=\"http:\/\/www.livesaymyers.com\/inside-the-courtroom-infographic\/\" target=\"_blank\" rel=\"noopener noreferrer\">infographics<\/a>, if done right, info graphics can still add a lot of value to your site &amp; people aren’t going to suddenly not like to be able to visualize information. Tools are another area where there is a million things that can be done to get users to your site. Have someone build you an <a href=\"http:\/\/bigverdict.com\/trafficinfo\/\" target=\"_blank\" rel=\"noopener noreferrer\">awesome tool<\/a> that is somewhat related to your legal niche and\/or useful on a local level. If you can get local people to come to your site out of interest (or better yet get them using your site regularly), you are creating top-level-awareness for potential future clients. Branding, traffic <i>and<\/i> links? Triple check.<br \/>\n<br \/>\nThese types of projects aren’t going to be the product of the SEO company that spams the forms on your site every other day. They aren’t going to come cheap because they don’t scale well. They require a lot of research, resources &#038; refining &#038; not every effort is going to be a home-run. But, rebuilding sites &#038; getting out of penalties isn’t cheap nor is it easy. Wouldn’t you rather create web equity &#038; build up your site for the long term rather than rebuilding it repeatedly? If you could ask someone who knows absolutely nothing about SEO to link to the content you’ve created &#038; it would make perfect sense for them to do so, then you’re likely in the right mindset &#038; doing something that will add value to your site and to their users for the long-term. The new rules of link building can be summed up in one sentence: <i>Stop building links &amp; start building equity!<\/i><\/p>\n","protected":false},"excerpt":{"rendered":"<p>So you want to rank highly for a competitive term in your niche. You’ve probably already figured out that this isn’t going to happen without a fair amount of links pointing back to your site. So how do you gain links without doing something that could eventually get you penalized. The short answer is: you &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The New Rules of Link Building For Lawyers&#8221;<\/span><\/a><\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[53,85],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The New Rules of Link Building For Lawyers - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The New Rules of Link Building For Lawyers - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"So you want to rank highly for a competitive term in your niche. You’ve probably already figured out that this isn’t going to happen without a fair amount of links pointing back to your site. So how do you gain links without doing something that could eventually get you penalized. The short answer is: you &hellip; Continue reading &quot;The New Rules of Link Building For Lawyers&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2014-04-21T00:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-26T15:24:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ryan Amen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"2 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/\",\"name\":\"The New Rules of Link Building For Lawyers - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#primaryimage\"},\"datePublished\":\"2014-04-21T00:00:00+00:00\",\"dateModified\":\"2019-11-26T15:24:18+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The New Rules of Link Building For Lawyers\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829\",\"name\":\"Ryan Amen\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g\",\"caption\":\"Ryan Amen\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The New Rules of Link Building For Lawyers - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/","og_locale":"en_US","og_type":"article","og_title":"The New Rules of Link Building For Lawyers - Nifty Marketing","og_description":"So you want to rank highly for a competitive term in your niche. You’ve probably already figured out that this isn’t going to happen without a fair amount of links pointing back to your site. So how do you gain links without doing something that could eventually get you penalized. The short answer is: you &hellip; Continue reading \"The New Rules of Link Building For Lawyers\"","og_url":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2014-04-21T00:00:00+00:00","article_modified_time":"2019-11-26T15:24:18+00:00","og_image":[{"url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"Ryan Amen","Est. reading time":"2 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/04\/No-Link-Bulding-Any-time.jpg"},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#webpage","url":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/","name":"The New Rules of Link Building For Lawyers - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#primaryimage"},"datePublished":"2014-04-21T00:00:00+00:00","dateModified":"2019-11-26T15:24:18+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/the-new-rules-of-link-building-for-lawyers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"The New Rules of Link Building For Lawyers"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829","name":"Ryan Amen","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g","caption":"Ryan Amen"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4530"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=4530"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4530\/revisions"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=4530"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=4530"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=4530"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}