{"id":4536,"date":"2014-06-13T00:00:00","date_gmt":"2014-06-13T00:00:00","guid":{"rendered":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/"},"modified":"2018-04-05T17:36:24","modified_gmt":"2018-04-05T17:36:24","slug":"my-business-insights-for-attorneys-useful-or-frivolous","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/","title":{"rendered":"My Business Insights For Attorneys: Useful or Frivolous?"},"content":{"rendered":"<p>Yesterday we looked at some of the more helpful sections of Google’s new My Business platform and how each of those sections could help you take control of your firm’s presence on Google. <a href=\"https:\/\/niftymarketing.com\/the-need-to-know-guide-to-google-my-business-for-lawyers\/\">Check it out here if you missed it.<\/a><\/p>\n<p>We left out the Insight section in that blog post. Google has been providing these insights, in some form or another, for a while now. In a way, it’s Google Webmaster Tools for Places. Insights provide some interesting data: how many people clicked for driving directions, how many people saw your listing, etc. Even with these stats, most Internet marketing reporting and strategy seems to discount the value of such information as just “Good to know”.<\/p>\n<p>If you have been ignoring your Insights reports, be prepared to change.  With the introduction of My Business Insights, Google has turned its redheaded stepchild into a full fledge member of the analytics family, allowing you to understand who is looking for you and how best to communicate with them. <\/p>\n<h2>Window into the Soul of Your Business<\/h2>\n<p>I read a blog post recently that said all business goals boil down to three “mother” goals: Win, Increase Revenue, Increase Profits. How do you accomplish any one of those three? Well, that’s a long post but the short version is by influencing people. Think about it: if you could know which customers were attracted to your brand, which messages would resonate with them, and how they preferred to connect with your brand, would you take advantage of that knowledge? Of course you would. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png\" alt=\"Insight Overview\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-779\" \/><\/p>\n<p>My Business Insights gives you all of this information and more. It gives you a snapshot of the people who have connected with your brand and lays out the clues to finding more people like them.  The base section gives you a quick glance version of this. But the real magic happens when you click the View Insights button. <\/p>\n<h2>Through the Looking Glass<\/h2>\n<p>Once you click the button you are taken to the following screen:<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Views-Overview.png\" alt=\"Views Overview\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-782\" \/><\/p>\n<p>The visibility tab shows your Views, Your Clicks, and Your Driving Directions. Each of these windows can have their time frames changed from the last 30 days to the last 7 days, last 90 days, or all time. <\/p>\n<h3>Views<\/h3>\n<p>This shows you when people laid eyes on your listing. In the example above, Sundays tend to be a big day for us. Let’s break that down a bit. If we click the down arrow next to the 899 total views, we get the following view:<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Views-Expanded.png\" alt=\"Views Expanded\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-781\" \/><\/p>\n<p>Not only can we see total views, but we can also see what those people viewed. This breakdown allows you to see which of your efforts are driving views. For this client, over the last 30 days, photos shared on our listing brought in the most views followed by search views in second place. Ok, first insight in our audience is that they like visuals. Duly noted. <\/p>\n<p>Now, if I were posting a lot on this listing, I may want to just see how well my posts are connecting with my audience. Easy, click all the check marks next to the ones we don’t want to see, to view just one specific type of view.  <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Views-Selected.png\" alt=\"Views Selected\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-783\" \/><\/p>\n<p>Based on of this graph I can see that the posts I share everyday are not having the market penetration I’m wanting. My Business Insights gives us more data on this (we’ll be chatting about a bit later), but for now I’m going to note that I may not be sharing the right kinds of posts. <\/p>\n<p>Breaking down each type of view and giving us the ability to track each type, allows us to better understand what is happening with our business listing on a daily basis. <\/p>\n<h3>Clicks<\/h3>\n<p>If we think of Views as impressions (in Webmaster Tools lingo as least), the clicks are the ultimate goal. We want to be seen but we want to be loved, I mean, clicked on. Understanding when people click and what they click can help us put together a better strategy to getting more clicks. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Clicks-Overview.png\" alt=\"Clicks Overview\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-776\" \/><\/p>\n<p>Talk about a blow to the stomach for this campaign. We had 899 total views, but only 11 clicks… We need to do something about that.  We had all of our clicks in the last month on one day. Our starting point for duplicating that day would be to figure out what happened on that day. Did our rankings jump and then drop? Did we share an awesome piece of content on our listing page? Were we in the news? Whatever it is for your firm, find it and then put together a plan on how to recreate it. <\/p>\n<p>Like the views graph, we can also see what people clicked on by clicking on the down arrow next to the total clicks. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Clicks-Expanded.png\" alt=\"Clicks Expanded\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-775\" \/><\/p>\n<p>Good to know that no one is clicking for directions to our office. Although, in this example, no one is clicking to our website either, so we don’t have enough data to determine next steps beyond working to get more people to interact with our listing. <\/p>\n<h3>Driving Directions<\/h3>\n<p>This section is a bit different as it actually gives us information about our visitors instead of just numbers. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Driving-Directions.png\" alt=\"Driving Directions\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-777\" \/><\/p>\n<p>OK, that’s interesting. We know that no one clicked to get directions but we are seeing a total of 17 direction requests. How did that happen? This section pulls information from Google Maps. Meaning if you have a map embedded on your site or if someone found you via the Google Maps app, they will show up here. <\/p>\n<p>Beyond knowing that people are finding us using the Google Maps app (which is my best guess as we are getting pretty specific geo-information like that provided by locations services on mobile phones), we also know that we are bringing in people from 2 specific zip codes. If I were this attorney (and I had 6 – 9 months of data supporting it) I would focus some of my offline marketing efforts in these zip codes. <\/p>\n<p>The goal with all of these insights is to understand and leverage your current clients in order to get more like them. Knowing which zip code is bringing in the most potential clients (clients, by the way, wanting to know how to drive right to your front door) is very useful information. <\/p>\n<p>There is one caveat to this information; all of these requests could be the same two people who are current clients. That’s why you should gather the data over time. I suggest you start a spreadsheet to record this data, as Insights will only provide you with the last 90 days. Once you have 6 months to a year, you should have a better idea of where your clients are coming from. <\/p>\n<h2>Care to be Engaged?<\/h2>\n<p>The engagement tab is where you can see how the tactics you have employed have affected your audience. In marketing terms, the visibility tab is brand exposure and the engagement tab is brand penetration.<\/p>\n<h3>Actions on Posts<\/h3>\n<p>Here’s the nitty gritty of your social marketing efforts on Google +. Did anyone do what we wanted with our posts? <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Actions-by-Post.png\" alt=\"Actions by Post\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-773\" \/><\/p>\n<p>Four actions aren’t anything to brag about but at least some people are doing something. Again if we click the down arrow next to total actions, we can get more specific information. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Action-by-Post-Expand.png\" alt=\"Action by Post Expand\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-771\" \/><\/p>\n<p>We got four shares. So what this tells us is that the current posts we are sharing on our page aren’t connecting with our users. We need to change our tactics if we want more brand interaction. But Insights gives more than just actions on our posts overall. It also shows us how each post did. <\/p>\n<h3>Recent Posts<\/h3>\n<p>With this section we get total actions as well as how people saw the post for each post we have shared. Depending on how many posts you share, you will have multiple pages of information. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Recent-Posts.png\" alt=\"Recent Posts\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-780\" \/><\/p>\n<p>Now we are getting somewhere. We can start looking at each one of these posts and asking questions like “Why did the Get rid of everything post get seen by more people?” or “The ladder post got the most actions, how come?” Examining these posts and gathering data on each one, like what time they were shared, did one have more pictures than another, was a different topic for us, etc, will give better insight into what your audience likes. This will lead to more actions and more views (as they share things, their friends will see it) that will lead to more brand exposure. <\/p>\n<h3>Average Action By Post Type<\/h3>\n<p>We don’t have to gather all of that data on our own. My Business breaks it down for us. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Action-by-Type.png\" alt=\"Action by Type\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-772\" \/><\/p>\n<p>All right, our users like our videos most, followed by photos. Useful info but it would be even better if we could see what actions people took on each type. <\/p>\n<p>Insights can provide that info for us if we just hover over one of the bars. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Actions-by-Type-Expanded.png\" alt=\"Actions by Type Expanded\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-774\" \/><\/p>\n<p>Awesome. Now we can compare our efforts to our goals and see how we are doing and what needs to change. <\/p>\n<p>For this attorney, if our goal were comments, sharing videos and photos is going to be our best chance of getting them (without changing the type of information we share). <\/p>\n<p>Overall the engagement section really helps you understand how your firm is interacting with its followers. You can then analyze and make better decisions about how to engage with them on this specific social channel.<\/p>\n<h2>Who&#8217;s On First?<\/h2>\n<p>Because Google + is a social network, we can get even more insight into the people who have interacted with our content. The audience section gives what country our followers are in as well as gender and age. Sadly, as the product just launched, this information has not yet populated for any of the locations we manage. Google says that in order to get this information you must have at least 200 followers. <\/p>\n<p>However, the section that is working, at least in some degree, is the New Follower section. <\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Followers-Overview.png\" alt=\"Followers Overview\" width=\"75%\" height=\"auto\" class=\"alignnone size-full wp-image-778\" \/><\/p>\n<p>I say working in some degree because of all the listings I looked at, they all had a massive jump in followers on 6\/11\/14, the day My Business launched. And it happened to all of the visitors the listing had. So I expect this graph will become more useful over time than it is right now. <\/p>\n<p>Regardless, this graph gives you the ability to track new followers, allowing you to see if a certain post garnered more followers so you can try to repeat those efforts to get more.  <\/p>\n<h2>What We’d Like To See<\/h2>\n<p>Google has given us a lot of information here and will allow attorneys and their marketers the ability to better track and understand how their firm is being seen and interacted with in the SERPs and on Plus. There is just one feature that we would love to see integrated into the system, phone tracking. <\/p>\n<p>Imagine how awesome it would be if you could use a tracking number in you’re my Business account and get the break down of how people saw your listing, how many people clicked for the website or directions, and how many people called directly from the listing. It’s a long shot but that one piece of information would allow a much better idea of ROI. <\/p>\n<h2>Putting it All Together<\/h2>\n<p>Including My Business Insights with Analytics and Webmaster Tools (and your Adwords reports if you are doing PPC) will allow you to have more complete vision of what is happening with your business in Google. It still has a few quirks to work out but overall the information provided by My Business Insights will enable you to make better decisions about where to put your focus and how to connect with more of your audience.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday we looked at some of the more helpful sections of Google’s new My Business platform and how each of those sections could help you take control of your firm’s presence on Google. Check it out here if you missed it. We left out the Insight section in that blog post. Google has been providing &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;My Business Insights For Attorneys: Useful or Frivolous?&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[88,85,52],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>My Business Insights For Attorneys: Useful or Frivolous? - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"My Business Insights For Attorneys: Useful or Frivolous? - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"Yesterday we looked at some of the more helpful sections of Google’s new My Business platform and how each of those sections could help you take control of your firm’s presence on Google. Check it out here if you missed it. We left out the Insight section in that blog post. Google has been providing &hellip; Continue reading &quot;My Business Insights For Attorneys: Useful or Frivolous?&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2014-06-13T00:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-04-05T17:36:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"NiftyAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/\",\"name\":\"My Business Insights For Attorneys: Useful or Frivolous? - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#primaryimage\"},\"datePublished\":\"2014-06-13T00:00:00+00:00\",\"dateModified\":\"2018-04-05T17:36:24+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"My Business Insights For Attorneys: Useful or Frivolous?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\",\"name\":\"NiftyAdmin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"caption\":\"NiftyAdmin\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"My Business Insights For Attorneys: Useful or Frivolous? - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/","og_locale":"en_US","og_type":"article","og_title":"My Business Insights For Attorneys: Useful or Frivolous? - Nifty Marketing","og_description":"Yesterday we looked at some of the more helpful sections of Google’s new My Business platform and how each of those sections could help you take control of your firm’s presence on Google. Check it out here if you missed it. We left out the Insight section in that blog post. Google has been providing &hellip; Continue reading \"My Business Insights For Attorneys: Useful or Frivolous?\"","og_url":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2014-06-13T00:00:00+00:00","article_modified_time":"2018-04-05T17:36:24+00:00","og_image":[{"url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"NiftyAdmin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/06\/Insight-Overview.png"},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#webpage","url":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/","name":"My Business Insights For Attorneys: Useful or Frivolous? - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#primaryimage"},"datePublished":"2014-06-13T00:00:00+00:00","dateModified":"2018-04-05T17:36:24+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/my-business-insights-for-attorneys-useful-or-frivolous\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"My Business Insights For Attorneys: Useful or Frivolous?"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06","name":"NiftyAdmin","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","caption":"NiftyAdmin"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4536"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=4536"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4536\/revisions"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=4536"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=4536"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=4536"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}