{"id":4540,"date":"2014-07-30T00:00:00","date_gmt":"2014-07-30T00:00:00","guid":{"rendered":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/"},"modified":"2018-04-05T17:54:48","modified_gmt":"2018-04-05T17:54:48","slug":"7-misconceptions-attorneys-have-when-it-comes-to-seo","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/","title":{"rendered":"7 Misconceptions Attorneys Have When It Comes To SEO"},"content":{"rendered":"<p>NiftyLaw was created soon after I started working here at <a href=\"https:\/\/niftymarketing.com\/\">Nifty<\/a>. I have been able to see its growth from infancy to adulthood. Having been around from the beginning until now, I have had the opportunity to work with a number of Attorneys and hear a range of ideas\/misconceptions about SEO and each Attorneys understanding of it. I have put together a list of ten misconceptions that I have heard over and over again.These misunderstandings can be detrimental to an Attorneys business.<\/p>\n<p>Our core message here at NiftyLaw is, “NiftyLaw brings honesty and originality into our partnerships with law firms to help them grow.” Our entire purpose for working with attorneys is to help them grow their business; working together to do so. Working together means taking what each of us is good at and using our strengths in a strategic and tactical way.<\/p>\n<p>If you want to be successful with your online marketing and SEO campaign you need to understand each of the following misconceptions and make sure you aren’t a victim to any of them.<\/p>\n<h2>7. My content is pure gold<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-902\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg\" alt=\"content\" width=\"600\" height=\"454\" \/><\/p>\n<p><a href=\"http:\/\/searchengineland.com\/guide\/seo\/content-search-engine-ranking\">Content is king<\/a>. We have all heard this, but it is only partially true. A better statement is “The Right Content is King”. We have worked with many attorneys that think their content is a rare gem and better than all of their competitors combined. They think there isn’t anything wrong with their majestic words.<\/p>\n<p>We have read and analyzed their content, and if their target market was other attorneys, it would be pure gold; but content has to be written for your target market. Your potential clients know you have spent many years in school and have years of experience as an attorney, however, they don’t speaker “Attorney”. All they want to know is WIIFM (What In It For Me). That’s it. Talk to them on their level and explain what you are going to do to benefit them. It’s that simple. Let us take what you have to say and translate it on your website so your potential clients will understand and hire you.<\/p>\n<h2>6. I know just enough to be dangerous!<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-897\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/enough-to-be-dangerous.png\" alt=\"enough to be dangerous\" width=\"600\" height=\"700\" \/><\/p>\n<p>These people are the fun ones to work with. I have talked with a recovering “I know just enough to be dangerous” person, and he regrets ever using that phrase. So why is this a misconception? If you know enough to be dangerous, then you shouldn’t do it.<\/p>\n<p>I eat, sleep and breath SEO and I still don’t know everything. I follow thought leaders and many others in the SEO community, I read blogs daily and test things constantly. SEO is what I do. Having my hand held by someone who knows enough to be dangerous and questions every thing I do slows things down. If we were to reverse the roles I think you would better understand what I am trying to say.<\/p>\n<p>Having a new client try and tell you (the attorney) what to do and when to do it doesn’t make a lot of sense does it? Just because someone has watched every season of Law and Order or read all of John Grisham&#8217;s books doesn’t make them a legal expert. So lets both do what we are good at, then work together and make something awesome happen.<\/p>\n<h2>5. I need a Facebook and Twitter and Linkedin and&#8230;<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-900\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/social.jpg\" alt=\"social\" width=\"500\" height=\"420\" \/><\/p>\n<p>Creating a social media account on every platform just to have one isn’t going to help you accomplish anything. Retweeting or regurgitating old news on a set schedule or hiring someone to manage your social media accounts aren&#8217;t necessarily the answers either.<\/p>\n<p>So, what is the correct way to use or think about social media accounts? You don’t own Facebook or Twitter or any of the social media platforms. They are just channels to help you get a message to people. The important piece of this puzzle is the message itself. What are you trying to tell people on social media? What do you want them to do? Where do you ultimately want them to end up? On your site.<\/p>\n<p>You need to generate awesome content on your own site&#8217;s blog that people will read. Then utilize the difference social media platforms to share that content linking back to your blog. You own your blog. You can do whatever you want with it. Get visitors to come to you site. Generate buzz around you site. This is how you as an attorney can optimally use social media. Be consistent with your blog posts, make them awesome and share the heck out of them.<\/p>\n<h2>4. Penalty Schmenalty<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-899\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/penalty.jpg\" alt=\"penalty\" width=\"512\" height=\"345\" \/><\/p>\n<p>Are you suffering from a manual Google penalty? Are you feeling the effects of a Penguin or a Panda penalty? Are you pissed off at Google? Are you yelling at your SEO company and blaming them because they are taking too long to get you out of penalty? Probably. So lets talk about penalties so you can better understand what they are, how they work and what is involved in getting them removed.<\/p>\n<p>There are two types of penalties:<\/p>\n<ul>\n<li>1. Manual Penalty &#8211; These penalties are issued by Google and you will get a message in your Google Webmastertools account telling you that you have been bad and to clean up your mess. The message will be very vague and cryptic and somewhat tell you what you need to do.After you decipher the message to the best of your ability you have to clean up what you think needs cleaned up (getting links removed and disavowing link which isn’t an easy or quick task by any means), then send in a reconsideration request begging Google to forgive you for your spammy tactics. They will then take up to several weeks to get back with you either removing the penalty or giving you more subtle hints and to what still needs fixed. You then have to go through the entire process again.<\/li>\n<li>2. Algorithmic Penalty &#8211; These penalties can happen when Google updates their algorithms. You won’t get a message telling you this has happened. The two biggest penalties are Penguin (links) and Panda (content).If you are hit with a Panda penalty you need to fix poor quality or duplicate content on your site. These algorithm updates happen every month so once you get the content re-written and on the site this should be a quick fix.Penguin on the other hand is not as forgiving. If you are hit with a penguin penalty you need to clean up spammy links that are pointing to your site. You have to get all of this done before the next algorithm update happens and hope you have done enough to get it removed. In the past, penguin updates have occurred every 6 months (it has now been over 9 months since the last Penguin update). So if you are hit with a Penguin penalty, there is no way to get out of it until the next update. No matter how bad you want to, or how much you yell at your SEO company to get you out of penalty, they can’t do it. They can get links removed and get you ready for the next update, but once things are cleaned up all you can do is wait.<\/li>\n<\/ul>\n<p><a href=\"http:\/\/moz.com\/beginners-guide-to-seo\/myths-and-misconceptions-about-search-engines\">Moz<\/a> puts it this way, “ Be aware that with the search engines, lifting a penalty is not their obligation or responsibility. Legally, they have the right to include or reject any site\/page for any reason. Inclusion is a privilege, not a right, so be cautious and don&#8217;t apply techniques you&#8217;re unsure or skeptical of &#8211; or you could find yourself in a very rough spot.”<\/p>\n<p>So take a deep breath. Don’t start yelling at your SEO company, (unless they caused the penalty for spammy tactics 😉 ) and work together to figure out a game plan for your specific penalty situations.<\/p>\n<h2>3. They popped up out of nowhere, you must be doing something wrong<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-903\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/wrong.jpg\" alt=\"wrong\" width=\"311\" height=\"311\" \/><\/p>\n<p>How many of you have monitored rankings for one of your major keywords (i.e. New York Personal Injury Attorney) and saw a competitor you have never heard of with an ugly site magically start ranking in a top position in Google?<\/p>\n<p>Now, how many of you have gone to your SEO company and accused them of doing things wrong saying that you have been working with them for months and should be outranking this new company? I hope you haven’t done that, and if you have you should call up your SEO company and apologize.<\/p>\n<p>Googles algorithms are complex. Nobody knows the secret sauce that makes their algorithm work the way it does. There have been about 87 algorithm updates in the last 5 years and things are constantly changing. There are also many factors that this new company could have already had in place to help them get to where they are, it just isn’t cut and dry. Just because they popped up and are ranking well doesn’t mean that your current SEO company is doing something wrong, or that this new companies rankings will stay. Here are just a few reasons why this could have happened:<\/p>\n<ul>\n<li>1. The new company could be using black-hat tactics and will maintain these rankings only for a short while.<\/li>\n<li>2. The new company could have purchased or taken over another company that has had a website for 15 years and redirected it to their new site passing all of the authority over.<\/li>\n<li>3. Your current SEO company is doing things wrong and you should come work with us 🙂<\/li>\n<\/ul>\n<p>Whatever the case might be, there are many different reasons as to why someone is ranking in Google. Each scenario needs to be assessed and a competitor analysis should be done to try and figure out what they are doing right or wrong. Understanding the competition better will help make better decisions or change the tactics of an SEO campaign. It doesn’t mean your SEO company is doing something wrong, it just means that you should work together to figure out what steps need to be taken for long term success.<\/p>\n<h2>2. Is copying content illegal?<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-896\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/copy-content.jpg\" alt=\"copy content\" width=\"600\" height=\"600\" \/><\/p>\n<p>I am going to let <a href=\"http:\/\/en.wikipedia.org\/wiki\/Plagiarism\">Wikipedia<\/a> do the talking for a minute. Plagiarism is the “wrongful appropriation” and “stealing and publication” of another author’s “language, thoughts, ideas, or expressions” and the representation of them as one’s own original work.<\/p>\n<p>I am amazed at how many people don’t think that grabbing content from another persons site (not in their competitive market) to use on there own isn’t an issue. Or that grabbing the content and slightly tweaking it is ok. I could tell you that it isn’t right, but you might come back and say, “who is this guy to tell me what I can and can’t do?” So I will let Google tell you that it is wrong since they own the internet.<\/p>\n<p>Not only is copying content unethical, it is against Google’s Quality Guidelines. You can be penalized for copying other peoples content. So the simple fix is not to do it. If you already have, then re-write the content. Whatever it takes, just get it done and stop copying others. If you haven’t been penalized for it already you will be. Googles algorithms constantly get better and better and will eventually catch up to you.<\/p>\n<h2>1. Ranking makes it rain!<\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-898\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/make-it-rain.gif\" alt=\"make it rain\" width=\"401\" height=\"185\" \/><br \/>\n(gif from http:\/\/giphy.com\/)<\/p>\n<p>I am not going to tell you that rankings don’t matter in this section. Ranking in Google and other Search Engines is a very important part of driving traffic to your site and generating new business, however, it shouldn’t be the only thing you pound out of your SEO company. It is an indicator that can show aspects of success with your campaign, but it isn’t everything. You can rank #1 for a specific term, but that doesn’t mean you are going to gain new clients and all of your worries are over.<\/p>\n<p>If all you focus on is rankings, your SEO company is going to be annoyed with you, and you obviously don’t understand search engine marketing. If you drive 10,000 people to your site and your site is hard to navigate or looks like it was built in the 90’s and doesn’t build a potential clients trust in you, then you have failed. If people can get to your site, but can’t figure out how to get to your office because the information is buried somewhere on your site and your citations are a mess, you have also failed. If potential clients can’t read what past clients have to say about you, or all they can find are negative comments, you have failed.<\/p>\n<p>Rankings are important, but not everything. Learn to work with and listen to your SEO company when they try to explain this. They are just telling the truth. If they say rankings don’t matter at all you might be a little worried. You can call us at that point.<\/p>\n<h2>Conclusion<\/h2>\n<p>If you read this post and realized you were reading about yourself, don’t worry, there is still hope for you. The first step to recovery is admitting you have a problem. The next step is doing something about it. Change. Start to work together with your search marketing team. Be an asset and not a stumbling block. If you don’t know the answer to something ask. Let the experts advise you on what is best for you. Think of the long term and what you are doing to build your brand. Once you have recovered completely, get your friends to do the same.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>NiftyLaw was created soon after I started working here at Nifty. I have been able to see its growth from infancy to adulthood. Having been around from the beginning until now, I have had the opportunity to work with a number of Attorneys and hear a range of ideas\/misconceptions about SEO and each Attorneys understanding &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;7 Misconceptions Attorneys Have When It Comes To SEO&#8221;<\/span><\/a><\/p>\n","protected":false},"author":8,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[85,68],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>7 Misconceptions Attorneys Have When It Comes To SEO - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"7 Misconceptions Attorneys Have When It Comes To SEO - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"NiftyLaw was created soon after I started working here at Nifty. I have been able to see its growth from infancy to adulthood. Having been around from the beginning until now, I have had the opportunity to work with a number of Attorneys and hear a range of ideas\/misconceptions about SEO and each Attorneys understanding &hellip; Continue reading &quot;7 Misconceptions Attorneys Have When It Comes To SEO&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2014-07-30T00:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-04-05T17:54:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dax Greener\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/\",\"name\":\"7 Misconceptions Attorneys Have When It Comes To SEO - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#primaryimage\"},\"datePublished\":\"2014-07-30T00:00:00+00:00\",\"dateModified\":\"2018-04-05T17:54:48+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/c1103648779cf9ad8aa13fe459a38235\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"7 Misconceptions Attorneys Have When It Comes To SEO\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/c1103648779cf9ad8aa13fe459a38235\",\"name\":\"Dax Greener\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/794bc0e0365f389f58234f3a5728f91c?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/794bc0e0365f389f58234f3a5728f91c?s=96&d=mm&r=g\",\"caption\":\"Dax Greener\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"7 Misconceptions Attorneys Have When It Comes To SEO - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/","og_locale":"en_US","og_type":"article","og_title":"7 Misconceptions Attorneys Have When It Comes To SEO - Nifty Marketing","og_description":"NiftyLaw was created soon after I started working here at Nifty. I have been able to see its growth from infancy to adulthood. Having been around from the beginning until now, I have had the opportunity to work with a number of Attorneys and hear a range of ideas\/misconceptions about SEO and each Attorneys understanding &hellip; Continue reading \"7 Misconceptions Attorneys Have When It Comes To SEO\"","og_url":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2014-07-30T00:00:00+00:00","article_modified_time":"2018-04-05T17:54:48+00:00","og_image":[{"url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"Dax Greener","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/07\/content.jpg"},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#webpage","url":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/","name":"7 Misconceptions Attorneys Have When It Comes To SEO - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#primaryimage"},"datePublished":"2014-07-30T00:00:00+00:00","dateModified":"2018-04-05T17:54:48+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/c1103648779cf9ad8aa13fe459a38235"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/7-misconceptions-attorneys-have-when-it-comes-to-seo\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"7 Misconceptions Attorneys Have When It Comes To SEO"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/c1103648779cf9ad8aa13fe459a38235","name":"Dax Greener","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/794bc0e0365f389f58234f3a5728f91c?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/794bc0e0365f389f58234f3a5728f91c?s=96&d=mm&r=g","caption":"Dax Greener"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4540"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=4540"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4540\/revisions"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=4540"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=4540"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=4540"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}