{"id":4544,"date":"2014-08-21T00:00:00","date_gmt":"2014-08-21T00:00:00","guid":{"rendered":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/"},"modified":"2018-04-05T15:09:24","modified_gmt":"2018-04-05T15:09:24","slug":"the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/","title":{"rendered":"The Once in a Lifetime Opportunity Available to Law Firms Right Now"},"content":{"rendered":"<p>How cool would it have been to be a part of the early dotcom companies? (You know, the ones that actually had business plans to go with their visions) Most people would jump at the opportunity to be the next Amazon or Google today. Back then, they were just a few people who saw an opportunity and had the courage to pursue it. In case you missed it, business publications and other prognosticators had serious doubts about these upstarts and whether they could compete with established and respected companies. (What <em>were<\/em> the names of those companies anyway?)<\/p>\n<p>Wouldn’t it be nice to see an opportunity like the early Internet again?<\/p>\n<p>If you are a law firm, such an opportunity exists today. (For a limited time only)<\/p>\n<h2>The Clone Wars<\/h2>\n<p><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-1000\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg\" alt=\"Clone Wars\" width=\"300\" height=\"157\" \/><\/a><\/p>\n<p>In our recent Nifty study of attorney websites, one constant that existed between all the sites was an annoying sameness; and it wasn’t just the Armani suits. It was if they were all trying to be the same competent, respected, and successful law firm. If I were an indecisive individual with my life on the line, I would never be able to make up my mind; I would be a goner.<\/p>\n<p>My real life experience with attorneys and law firms has been that once you get past the receptionist and the conference room, the homogenized image disappears. In the back offices, lurks an erudite, witty, and competitive bunch of people as diverse as any professional company. They care about their clients, they want to win their case, and they spilled mustard on their tie while watching the World Cup in the middle of the day.<\/p>\n<p>I recognize that attorneys have bar associations limiting what they can say, but the sterile image attorneys portray on the Internet to stay within those guidelines isn’t doing anyone any favors. I sometimes feel they are trying so hard not to say something wrong that they forget to say something right.<\/p>\n<h2>Business is Business<\/h2>\n<p>Just so you know, my marketing experience began before the Internet. However, from what I can see, the principles of business haven’t changed just because the venue has.<\/p>\n<p>Potential clients <em>actually are<\/em> looking for a competent, respected, and successful lawyer but they are also looking for one who will honestly talk to them and acknowledge their specific needs, while giving them hope. They want to know that you are a real person who will understand their situation. And they expect you to introduce yourself in some undefined yet intimate way.<\/p>\n<p>In the old days, this was called branding. Even then, most people were confused about what branding meant. I once had a client who felt his first priority to establish his brand was to create a Nike “Swoosh.” I asked him what he wanted his swoosh to stand for. He just gave me a blank stare, as if to say I obviously didn’t know what I was doing.<\/p>\n<p style=\"text-align: center;\"> <a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/Nike-Shoe.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-999\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/Nike-Shoe-300x171.jpg\" alt=\"Nike Shoe\" width=\"300\" height=\"171\" \/><\/a><\/p>\n<p>The original Nike swoosh didn’t mean anything to people at first. Phil Knight hired college student Carolyn Davidson to design the now iconic symbol. It took her 17.5 hours to come up with the swoosh, and at $2.00 an hour she invoiced Nike $35.00. Phil Knight didn’t like the logo but thought it might grow on him. It was only after people discovered that Nike made shoes that made everyone feel they could win the Boston Marathon that the swoosh began to mean anything. Ms. Davidson was eventually awarded $150 in stock for her design. (Now worth three quarters of a million dollars)<\/p>\n<p>Logos, without a unique message and awesome products or services behind them don’t mean much. Apple’s logo without “Apple” is just an apple, after all.<\/p>\n<p>So, who are you? What does your swoosh stand for? As primal as that question is, it is amazing how many people, companies, and law firms are stumped by it. Most never do answer. I believe they should, since it is impossible to effectively brand your law firm or any entity until you can honestly say, “This is who we are.”<\/p>\n<p>I believe the winner of the Internet battle for lawyer supremacy will eventually be any law firm that learns how to effectively brand themselves. It isn’t an easy process and it doesn’t happen overnight. But if you want to be competitive, it needs to happen.<\/p>\n<p style=\"text-align: center;\">Three Important Elements of Internet Branding for Attorneys<\/p>\n<p style=\"text-align: center;\">(And one sacred cow of marketing lawyers shouldn’t bother with)<\/p>\n<h2>#1 – Why being yourself is so crazy it just might work.<\/h2>\n<p>I know a few attorneys that are the coolest people you will never meet on the Internet. You will never meet them because they are afraid if you found out who they actually were, you wouldn’t want them to be your attorney. Instead, they put on an image they think you expect. It is an interesting phenomenon that lawyers spend so much energy trying to convince people they aren’t the stereotypical jerks that embody lawyer jokes, yet then try to cram themselves into another, more positive stereotype.<\/p>\n<p>The problem with this approach is that even a positive stereotype is still a stereotype. It is hard to stand out when you look like everyone else.<\/p>\n<p>And what do you do about it? You hire an SEO company that promises you will show up on page one.  You’re first in line (but that won’t last) and you still look like everyone else.<\/p>\n<p>So how do you stand out? Especially on the Internet.<\/p>\n<p><strong> <a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/Be-yourself-e1408643256300.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-1004\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/Be-yourself-277x300.jpg\" alt=\"Be yourself\" width=\"277\" height=\"300\" \/><\/a><\/strong><\/p>\n<h2>Don’t be a copy<\/h2>\n<p>One thing we content creators hear everyday is how important it is for our content to be authentic. It is brought up so often, the term “authentic content” has become a cliché. The idea is that authentic, original content is so rare and precious that we will wade through several pages on a Google search just to find it.<\/p>\n<p>So how do you find your authentic voice? Especially when you have spent most of your life trying to conform to standards and tests to get accepted into college, law school, pass the bar exam, and land your first job. We are practically programmed to be a fake. Anyway, good luck.<\/p>\n<h2>Wait!<\/h2>\n<p>Think about it. You didn’t get this far being a pushover. You are intelligent and you’re a good problem solver. Along this journey, you have had something to say. Perhaps you felt you didn&#8217;t have permission to say it. Well, except for your state bar, nobody is stopping you from saying what you want to now. You have a law practice, a website, and whole lot of blank space. Say something that only you can say.<\/p>\n<p>When you allow your unique thoughts, ideas, and personality to be put on display without apology, you become infinitely more appealing than a clone. At Nifty, we call this being “willingly naked.” It isn’t a logo; it is a feeling, an attitude, an ethic, and it’s your brand. You won’t appeal to everyone, but you will attract the clients you want to work with.<\/p>\n<p><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/Public-Speaking.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-1001\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/Public-Speaking-300x294.jpg\" alt=\"3d human give a lecture behind a podium\" width=\"300\" height=\"294\" \/><\/a><\/p>\n<h2>#2 – Who are you talking to?<\/h2>\n<p>True story. One reason I like working at Nifty is that my department is devoid of yes men\/women. I will often submit a blog or article with pride to Lance Pincock, our content director and literary genius half my age. After a condescending, yet playful eye role, he is usually able to fix my rough draft into a working draft with one prying question, “Who are you talking to?” I sigh and hang my head, realizing that if he can’t tell whom I am talking to then nobody else will either.<\/p>\n<p>This is important, especially on the web.<\/p>\n<p>It reminds me of a time I landed on a site that appeared interesting. After a few minutes, I didn’t feel like they were talking to me, so I stopped reading. I then noticed that the article had 150,000 shares. They knew whom they were talking to; it just wasn’t me.<\/p>\n<p>In contrast to that site, we once interviewed a lawyer that wanted to land higher paying clients. (Who doesn’t?) Auditing his site, we noticed that his entire site was written to potential clients that were barely scraping by. It almost wasn’t subtle. Again the fix came from the question, “Who are you talking to?”<\/p>\n<p>Think of your client; age, income, attitudes, problems, education, and whatever else you can think of, and write to that client. You can’t write to everyone. Everyone isn’t going to be your client. Write to <em>your<\/em> clients.<\/p>\n<h2>#3 – Be a storyteller<\/h2>\n<p>According to scientists who study the brain, the human brain is wired for storytelling. The simple explanation is this. A story is a connection of cause and effect. It activates the emotional side of our brain, the part of our brain that makes most of our decisions.<\/p>\n<p>Conversely, a presentation consisting of informative bullet points activates our language center. We process each point as words, which we then translate into meanings . . . and then we move to the next bullet point. That’s it.<\/p>\n<p><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/LadyJusticeImage-540x360.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-1003\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/LadyJusticeImage-540x360-300x193.jpg\" alt=\"LadyJusticeImage-540x360\" width=\"300\" height=\"193\" \/><\/a><\/p>\n<p>Not to point out the obvious, but Lady Justice is blind, not deaf. I can’t think of any profession that is more story-centric than the law. Every client has a story. They come to you because they want you to tell them how it is going to end.<\/p>\n<h2>Why Stories?<\/h2>\n<p>The nice thing about marketing on the Internet compared to other channels is its rapid feedback. Did you hit the mark or not? Over the last several years, the data is clear; those who can tell the best story will win.<\/p>\n<p>Not to throw politics into the mix but the last presidential race makes my point. I think Romney made the mistake of telling the wrong stories. While telling a group of struggling factory workers that he owned two Cadillacs to emphasize his support of <em>Made in America<\/em> he inadvertently drove home the point that he was out of touch with the rest of us.<\/p>\n<h2>What is your story?<\/h2>\n<p>Even with lawyers, feedback shows that when it comes to selling yourself or your firm, <em>your story<\/em> is what potential clients want to hear. They want to hear, for example, why you became a lawyer, why you are still a lawyer, and they will respond if you tell it as your story. Telling them you graduated from The University of Chicago Law School is usually just a bullet point, unless, of course, they know law schools. Then they will want to know your story behind that as well.<\/p>\n<h2>#4 – Don’t stress about #4<\/h2>\n<p>Number four in marketing is identifying your Unique Selling Proposition or USP. It is fundamental to all marketing plans. However, it may be impractical and sometimes illegal for lawyers to offer the type of propositions that other businesses do. You can’t offer 2-for-1 DUI cases. Nor can you offer a rebate of 15% if you lose a case. Law is a service. You aren’t a used car salesman.<\/p>\n<p><a href=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/car_salesman_sleezy.jpg\"><img loading=\"lazy\" class=\"alignnone size-medium wp-image-1002\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/car_salesman_sleezy-300x225.jpg\" alt=\"car_salesman_sleezy\" width=\"300\" height=\"225\" \/><\/a><\/p>\n<p>Your USP is your brand; and your brand is you. It is you being yourself, offering your expertise, and telling your story to your client. Your brand isn’t the logotype above the receptionist, it is the combined story of every name there.<\/p>\n<h2>In conclusion<\/h2>\n<p>As I mentioned in the beginning, few firms, if any, are taking this approach. It isn’t a new or a radical idea, its just that most attorneys have yet to feel comfortable with it. However, every year more attorneys graduate and enter the market. As the industry becomes more competitive than it already is, those who accept this strategy will be the ones who come out ahead.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How cool would it have been to be a part of the early dotcom companies? (You know, the ones that actually had business plans to go with their visions) Most people would jump at the opportunity to be the next Amazon or Google today. Back then, they were just a few people who saw an &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The Once in a Lifetime Opportunity Available to Law Firms Right Now&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[53,85],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Once in a Lifetime Opportunity Available to Law Firms Right Now - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Once in a Lifetime Opportunity Available to Law Firms Right Now - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"How cool would it have been to be a part of the early dotcom companies? (You know, the ones that actually had business plans to go with their visions) Most people would jump at the opportunity to be the next Amazon or Google today. Back then, they were just a few people who saw an &hellip; Continue reading &quot;The Once in a Lifetime Opportunity Available to Law Firms Right Now&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2014-08-21T00:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-04-05T15:09:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"NiftyAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/\",\"name\":\"The Once in a Lifetime Opportunity Available to Law Firms Right Now - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#primaryimage\"},\"datePublished\":\"2014-08-21T00:00:00+00:00\",\"dateModified\":\"2018-04-05T15:09:24+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Once in a Lifetime Opportunity Available to Law Firms Right Now\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\",\"name\":\"NiftyAdmin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"caption\":\"NiftyAdmin\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Once in a Lifetime Opportunity Available to Law Firms Right Now - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/","og_locale":"en_US","og_type":"article","og_title":"The Once in a Lifetime Opportunity Available to Law Firms Right Now - Nifty Marketing","og_description":"How cool would it have been to be a part of the early dotcom companies? (You know, the ones that actually had business plans to go with their visions) Most people would jump at the opportunity to be the next Amazon or Google today. Back then, they were just a few people who saw an &hellip; Continue reading \"The Once in a Lifetime Opportunity Available to Law Firms Right Now\"","og_url":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2014-08-21T00:00:00+00:00","article_modified_time":"2018-04-05T15:09:24+00:00","og_image":[{"url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"NiftyAdmin","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2014\/08\/yodaclone-300x157.jpg"},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#webpage","url":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/","name":"The Once in a Lifetime Opportunity Available to Law Firms Right Now - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#primaryimage"},"datePublished":"2014-08-21T00:00:00+00:00","dateModified":"2018-04-05T15:09:24+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/the-once-in-a-lifetime-opportunity-available-to-law-firms-right-now\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"The Once in a Lifetime Opportunity Available to Law Firms Right Now"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06","name":"NiftyAdmin","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","caption":"NiftyAdmin"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4544"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=4544"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4544\/revisions"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=4544"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=4544"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=4544"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}