{"id":4559,"date":"2016-04-05T00:00:00","date_gmt":"2016-04-05T00:00:00","guid":{"rendered":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/"},"modified":"2019-11-25T21:15:15","modified_gmt":"2019-11-25T21:15:15","slug":"elements-effective-law-firm-website","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/","title":{"rendered":"The Elements of an Effective Law Firm Website"},"content":{"rendered":"<p>Your law firm website can be a powerful tool, if it&rsquo;s constructed thoughtfully. A strong web presence is becoming increasingly important as Millennials make up more and more of the target market for most law firms. Statistically, it&rsquo;s very likely that you are not taking full advantage of those possibilities. The good news is that much of your competition is behind the curve. That means opportunity for the law firm willing to invest in using this guide to create and maintain an effective legal website.<\/p>\n<h3>An Effective Law Firm Website Is User Friendly<\/h3>\n<p>Your law firm website can&rsquo;t do its job if it&rsquo;s annoying, confusing, or inaccessible to your prospective clients. Your ability to establish expertise, connect with your market and convert visitors through your website depend on their ability to easily find what they&rsquo;re looking for and understand it. These elements will allow visitors to move around your site comfortably and make the most of the information they find there.<\/p>\n<p>Clarity:&nbsp;A visitor to your website should be able to understand at a glance what you&rsquo;re offering and to whom. Inviting colors, beautiful graphics and a professional impression are important, but they&rsquo;re just tools. Your website&rsquo;s job is to let prospective clients know exactly what you have to offer them, and you don&rsquo;t want to make them work for it.<\/p>\n<p>Data on precisely how long you have to capture your website visitors&rsquo; attention varies somewhat, but tops out at about 10 seconds. Many experts estimate lower, at three to seven seconds. Regardless of which figure you accept, the bottom line is the same: the instant a prospect lands on your site, he should know whether you offer what he&rsquo;s looking for. Consider the law firm home page below.<\/p>\n<p>In many ways, this is a very effective law firm web page. It looks professional. Contact information is immediately apparent. The tag line promises success. Awards and recognition from respected organizations and publications are prominently but tastefully featured. The green accents subtly say &ldquo;money&rdquo;. Yet, this firm&rsquo;s home page has a significant weakness: it isn&rsquo;t until the second half of the second paragraph that we learn what the law firm does. And, when that information is finally presented, it&rsquo;s in a standard font in the midst of a block of text&mdash;not easily spotted on a quick once-over of the page.<\/p>\n<p>Contrast that page with this&nbsp;<a href=\"http:\/\/workinjuryaz.com\/\">Arizona Workers Compensation Law Firm&rsquo;s site<\/a>, where &ldquo;Arizona Workers Compensation Attorneys&rdquo; is prominently featured near the top of the page. There is no question what they do.<\/p>\n<p>Now, some attorneys have their practice area worked into the logo. Others do so much it takes more space to cover the practice areas. The key is ensuring that when potential clients come to your website there is a clear answer to this question:<\/p>\n<p>&ldquo;Am I in the right place to find the information or services I&rsquo;m looking for?&rdquo;<\/p>\n<p>Accessible Language:&nbsp;Your law firm website isn&rsquo;t a law review article. You&rsquo;re speaking to your prospective clients, who are often consumers or small business owners with no legal background. Law school may have conditioned you to speak formally, apply flawless logic and show off your knowledge, but your prospective clients don&rsquo;t want to know that you&rsquo;re a great scholar&mdash;they want to know that you understand their problems and have real-life solutions for them. You convey that by speaking in language they&rsquo;ll understand, about the issues that concern them.<\/p>\n<p>Speaking your prospective clients&rsquo; language helps bring them to your site, too. You&rsquo;ve undoubtedly heard about the power of long-tail search terms. Those longer phrases draw targeted visitors to your website because they mimic the language your prospective clients will use when searching for information or services online. There&rsquo;s no better source of information about the language your target market uses than your current clients and prospects.<\/p>\n<p>Separate Practice Area Sections\/Pages:&nbsp;Recently, there&rsquo;s been a lot of discussion about whether a law firm that has offices in different cities or operates in multiple practice areas should have separate law firm websites. That&rsquo;s a question worth delving into another day, but for purposes of this guide I&rsquo;m assuming a single law-firm website.<\/p>\n<p>Separating out practice areas on your law firm&rsquo;s website accomplishes many of the goals of the separate site system: it focuses content that&rsquo;s relevant to the visitor, makes it easy for the prospective client to find the information they&rsquo;re looking for and enhances your ability to target keywords within a particular practice area. Clarity and ease of navigation on a site that&rsquo;s divided into practice areas improve user experience and increase the likelihood that a visitor will remain on the site, while those focused individual practice areas pages make it more likely that prospective clients will find your site through search and will enter on a relevant page. At the same time, a partitioned approach to a single law firm website sidesteps some of the pitfalls of multiple sites, such as client confusion when they search for your firm by name and land on the wrong site.<\/p>\n<p>Responsive Design: According to <a href=\"http:\/\/www.slideshare.net\/FindLawLawyerMarketing\/legal-infographic-findlaw?next_slideshow=1\">Google<\/a>, 42% of people seeking legal advice online switch between devices during their research. That means prospects may be viewing your site on more than one device, and also that you can&rsquo;t accurately predict which type of device they&rsquo;ll be using to visit your site.<\/p>\n<p>Responsive design allows your law firm website to adapt to the device, creating a better and more consistent user experience. That&rsquo;s good for your visitors, of course, but it&rsquo;s also good for your law firm. We know that most&nbsp;<a href=\"http:\/\/resources.mobify.com\/50-mobile-commerce-stats.html\">mobile device users will abandon a site<\/a>&nbsp;if it doesn&rsquo;t load within three seconds, so a website that&rsquo;s designed for desktop users only could cost you the opportunity to convert a significant percentage of your visitors to prospects or clients.<\/p>\n<p>Also, in a recent study we conducted across 50 U.S. markets and 4 Legal practice areas we found that 90.5% of the law firms ranking in the 1st position had responsive websites.<\/p>\n<h3>An Effective Law Firm Website Is Search Engine Optimized<\/h3>\n<p>The most effective, user-friendly, conversion-oriented law firm website ever designed won&rsquo;t do you a bit of good if your prospective clients don&rsquo;t see it. You may be driving some traffic to your site with paid advertising or through referrals, but creating a great law firm website that isn&rsquo;t optimized for search is like commissioning a beautiful sign for your business and then planting a big tree in front of it. Take these steps to help prospects find your law firm site.<\/p>\n<p>On page SEO:&nbsp;In this section, I&rsquo;ll cover some of the key elements. However, this is a very important element in the success (or failure) of your law firm&rsquo;s website, and I&rsquo;d strongly encourage you to take the time to fully educate yourself or get&nbsp;<a href=\"https:\/\/niftymarketing.staging.com\/services\/legal-seo-services\/\">expert SEO help<\/a>.<\/p>\n<p>Some of the core on page elements that you can easily optimize include:<\/p>\n<ul>\n<li>Determining the most effective keywords for your practice, based not just on volume but on the terminology your market uses and there change of gaining a call or form fill<\/li>\n<li>Structuring your content to naturally include keyword topics rather than attempting to apply a formula, and ensuring you use related terminology on the page<\/li>\n<li>Providing substantive, long-form content on key pages &ndash; the&nbsp;<a href=\"http:\/\/backlinko.com\/search-engine-ranking\">average Google first-page result<\/a>&nbsp;contains 1,890 words<\/li>\n<li>Making use of keyword\/topic-based H1 and H2 titles, preferably with the primary keyword at the front of the title<\/li>\n<li>Including relevant imagery and videos optimized for size and usability<\/li>\n<\/ul>\n<p>Structural SEO:&nbsp;Technical optimization of your website requires even more specific expertise than content optimization. In the same way that having a fantastic website doesn&rsquo;t help you if prospective clients can&rsquo;t find it, having beautifully optimized content won&rsquo;t help you if Google and other search engines can&rsquo;t read your site, or if technical issues like loading time tank your rankings.<\/p>\n<p>Some of the key areas to focus on include:<\/p>\n<ul>\n<li>Page loading time across device types; Google has included loading time in its algorithm since 2010, but the importance of speed is increasing with the popularity of mobile search<\/li>\n<li>SEO-friendly URL structures that incorporate keywords up front<\/li>\n<li>Creation and submission to Google of an XML sitemap<\/li>\n<li>Eliminate duplicate content or, if you&rsquo;re using duplicate content for paid landing pages, use robots.txt files to tell search engines to disregard the duplicate pages<\/li>\n<\/ul>\n<p>Off Site SEO Support:&nbsp;How well your site&rsquo;s pages rank in search depends heavily on those content and structural factors discussed above (and many others), but there&rsquo;s an additional element you can&rsquo;t afford to overlook. Search engine algorithms don&rsquo;t rely entirely on the site owner to tell them what the pages are about and how useful they are.<\/p>\n<p>The most powerful offsite tool for getting your pages in front of people searching for services like yours is link building. Here are a few key strategies for cultivating inbound links that will boost your rankings.<\/p>\n<ul>\n<li><a href=\"https:\/\/niftymarketing.staging.com\/the-new-rules-of-link-building-for-lawyers\/\">Create great content<\/a>&nbsp;&ndash; there&rsquo;s no better way to encourage others to link to your content than to create something they want to read, remember, and share<\/li>\n<li>Cultivate social shares &ndash; social shares that can be crawled count just like website links in Google&rsquo;s algorithm<\/li>\n<li>Build your brand &ndash; since the Panda update, unlinked references to and votes of confidence for your brand do play a role in search rankings even if it is indirect consequence.<\/li>\n<li>Give special attention to local link building &ndash; see our free&nbsp;<a href=\"http:\/\/niftymarketing.staging.com\/list-of-local-link-building-ideas\/\">Ultimate List of Local Link Building Ideas<\/a>&nbsp;for more information<\/li>\n<\/ul>\n<h3>An Effective Law Firm Website Is Conversion-Oriented<\/h3>\n<p>Drawing traffic to your site is a good start, and making it easy for your visitors to understand what you&rsquo;re offering and find their way around your site builds on that foundation. But, your goal isn&rsquo;t just to generate traffic or keep people on the site&mdash;it&rsquo;s to convert those website visitors into clients. You can increase website conversions by ensuring that your website includes these features.<\/p>\n<p>Clear, Strong Calls to Action (CTAs):&nbsp;If you were going to make only one change to your legal website in an effort to increase conversions, adding direct, powerful calls to action would be your best bet.<\/p>\n<p>Effective CTAs are critical for any business site, but all the more so when it comes to a law firm website. Most people aren&rsquo;t searching for an attorney online when they&rsquo;re feeling calm and in control of their lives, and they often don&rsquo;t know what to do next. You have to tell them. And, you have to do so in a manner that&rsquo;s clear, direct, and hard to miss.<\/p>\n<p>As I explained in a recent post, you&rsquo;ll want to use&nbsp;<a href=\"https:\/\/niftymarketing.staging.com\/choosing-the-right-color-for-your-law-firm-website-branding\/\" aria-invalid=\"true\">contrasting colors for your CTA buttons<\/a>&mdash;the last thing you want is for your call to action to blend quietly into the site.<\/p>\n<p>Strong Attorney Profiles with Photos:&nbsp;If you&rsquo;re like many attorneys, you haven&rsquo;t given a lot of thought to your website bio. You may not even have created profile pages for your attorneys. If you think that visitors to your site are more interested in the practice-area information you&rsquo;ve provided, think again. The data we&rsquo;ve collected from working with a wide range of law firms shows that attorney profile pages are among the most visited on law firm websites.<\/p>\n<p>The purpose of your attorney bio isn&rsquo;t to establish your expertise&mdash;at least, not entirely. Familiarity breeds comfort. Include at least one photo on your bio page, and if you&rsquo;re practicing in a consumer law area, you may want to make that photo less formal than your typical headshot. Consider a short video, an audio clip from an interview you did, or other content that lets the prospective client feel like he knows you beyond the words on the page.<\/p>\n<p>Don&rsquo;t neglect those words, though. Make sure you open strong and not, as many attorneys do, with a dry sentence about the law school you graduated from or how many years you&rsquo;ve been in practice. Hit the highlights of your career and possibly education, but also mention your family, your community involvements, your passion for eighteenth century Roman pottery. In short, let the prospective client experience you not just as an attorney, but as a fellow human who can be trusted with his problems.<\/p>\n<p>Multiple Ways to Contact You, Clearly Presented:&nbsp;Wouldn&rsquo;t it be nice if every prospective client used your preferred contact method? Maybe you don&rsquo;t have a receptionist, so you&rsquo;d really rather those prospects simply filled out the form on your website so that you could get back to them when you had time. Maybe you&rsquo;re old school and you think everyone should just pick up the phone and schedule an appointment like they did for decades before online interactions became the norm for a generation.<\/p>\n<p>That&rsquo;s not important.<\/p>\n<p>An effective website makes it easy for the prospect to take the next step, and you make it easy by allowing her to choose the method of contact that&rsquo;s most comfortable for her. That means providing a variety of ways to convert and making them easy to find. According to&nbsp;<a href=\"http:\/\/www.mycase.com\/blog\/2015\/09\/website-mistakes-coat-law-firm-money-infographic\/\">MyCase<\/a>, many small businesses are falling short in this area, with nearly half lacking even a telephone number on the home page.<\/p>\n<p>At a minimum, you should offer a telephone number and at least one electronic contact method (email or contact form). But, that&rsquo;s a bare minimum. Many of your competitors are offering a much wider range of options, like this&nbsp;<a href=\"http:\/\/naqvilaw.com\/\">Las Vegas Personal Injury Attorney<\/a>.<\/p>\n<p>In addition to a prominently displayed telephone number, this page offers a contact form, a live chat option and a &ldquo;contact us&rdquo; item in the main navigation. When you mouse over that menu item, you see a drop down offering still more options.<\/p>\n<p>Optimized Contact Forms:&nbsp;Your contact form should be just one of multiple ways a prospective client can reach you, but that doesn&rsquo;t mean that you can afford to drop in a generic form. Your contact form should be a call to action in itself, or very closely coupled with a strong CTA. Naturally, you&rsquo;ll want to gather as much information as possible, but the prospect won&rsquo;t want to invest too much time or reveal too much personal information before you&rsquo;ve even spoken. So, you&rsquo;ll have to take the time to determine which fields are truly important when weighed against the possibility that your prospect will abandon the form.<\/p>\n<p>Be sure to base this optimization on testing, not intuition. Prospects don&rsquo;t always behave as you might expect. For example, take a look at the two forms below:<\/p>\n<p><a href=\"http:\/\/www.formisimo.com\/blog\/7-best-ways-to-decrease-your-form-abandonment-rate\/\">Formisimo<\/a>&nbsp;presents the above example of how language that slows the visitor down increases the rate of abandonment, but it serves just as well to illustrate that you can&rsquo;t always predict how your visitors will respond. Instead, you have to rely on data. When the &ldquo;100% privacy&rdquo; note was added to the above form, conversions dropped. Language that was meant to be reassuring and encourage visitors to enter their information had the opposite impact.<\/p>\n<h3>An Effective Law Firm Website Showcases Your Expertise And Professionalism<\/h3>\n<p>Searching for an attorney online isn&rsquo;t like shopping for the best price on a pair of Converse. A prospective client must have faith in the attorney&rsquo;s ability and inclination to get the job done, and your website content is one of the most powerful tools for establishing that expertise and reliability before the prospect ever makes contact. Your website offers many opportunities to show clients who you are and what you have to offer.<\/p>\n<p>A Regularly-Maintained Blog: Your law firm blog offers a unique opportunity to show your prospective clients that you not only understand the law and know how to put it to work for them, but also understand their core questions and concerns. As an added bonus, regular blogging increases both traffic and conversions.<\/p>\n<p>Source:&nbsp;<a href=\"http:\/\/cdn1.hubspot.com\/hub\/53\/Marketing-Benchmarks-from-7000-businesses.pdf\">Hubspot<\/a><\/p>\n<p>Some of the most straightforward ways to use your blog to showcase your expertise are to write posts based on questions you hear frequently from prospects and clients and to comment on current cases in the news that fall within your practice area.<\/p>\n<p>Just as an active blog can be a powerful marketing tool, an inactive blog can send a very negative message to prospects. If your dated posts stopped months ago, what are you saying to your visitors about your time management and follow-through?<\/p>\n<p>Up-to-Date Content:&nbsp;Of course, outdated content&mdash;even something as simple as a copyright date that hasn&rsquo;t been updated in five years&mdash;can create the same negative impression as a dormant blog. More importantly, laws and procedures evolve, and failing to keep up with those changes can undermine your expertise.<\/p>\n<p>For example, if you&rsquo;re a bankruptcy attorney and list fees, Chapter 13 limits, or median income figures on your website, those numbers change. Some change on a regular schedule and others are sporadic, but they won&rsquo;t stay fixed indefinitely. Outdated figures on your website will create client confusion and may shake his faith in you.<\/p>\n<p>Testimonials and Success Stories:&nbsp;One of the most direct ways to establish that you&rsquo;re skilled and knowledgeable in your field is to call attention to past successes, whether that means reporting case outcomes, soliciting testimonials from clients or feeding your reviews from an outside site to your law firm website.<\/p>\n<p>The upsides are obvious, but there are pitfalls as well. First and foremost, if you&rsquo;re considering including testimonials, verdicts, or reviews on your website, make sure you&rsquo;ve thoroughly reviewed your state&rsquo;s attorney advertising regulations. In some states, this type of marketing is prohibited or strictly regulated.<\/p>\n<p>Creating a highly effective website for your law firm isn&rsquo;t a quick, easy process, but it&rsquo;s well worth the time investment. If you don&rsquo;t have the expertise or can&rsquo;t spare the time to overhaul your site to increase conversions, we can help. Learn more about how our legal website development services can improve your bottom line.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your law firm website can be a powerful tool, if it&rsquo;s constructed thoughtfully. A strong web presence is becoming increasingly important as Millennials make up more and more of the target market for most law firms. Statistically, it&rsquo;s very likely that you are not taking full advantage of those possibilities. The good news is that &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The Elements of an Effective Law Firm Website&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":5456,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[85,108],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Elements of an Effective Law Firm Website - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Elements of an Effective Law Firm Website - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"Your law firm website can be a powerful tool, if it&rsquo;s constructed thoughtfully. A strong web presence is becoming increasingly important as Millennials make up more and more of the target market for most law firms. Statistically, it&rsquo;s very likely that you are not taking full advantage of those possibilities. The good news is that &hellip; Continue reading &quot;The Elements of an Effective Law Firm Website&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2016-04-05T00:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-25T21:15:15+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/mlteaxgv3vr6.i.optimole.com\/mJASZg-J7ZphFWM\/w:1200\/h:800\/q:auto\/https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/04\/web-elements.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"800\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"NiftyAdmin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"16 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/04\/web-elements.jpg\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/04\/web-elements.jpg\",\"width\":1200,\"height\":800},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/\",\"name\":\"The Elements of an Effective Law Firm Website - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#primaryimage\"},\"datePublished\":\"2016-04-05T00:00:00+00:00\",\"dateModified\":\"2019-11-25T21:15:15+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Elements of an Effective Law Firm Website\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06\",\"name\":\"NiftyAdmin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g\",\"caption\":\"NiftyAdmin\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Elements of an Effective Law Firm Website - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/","og_locale":"en_US","og_type":"article","og_title":"The Elements of an Effective Law Firm Website - Nifty Marketing","og_description":"Your law firm website can be a powerful tool, if it&rsquo;s constructed thoughtfully. A strong web presence is becoming increasingly important as Millennials make up more and more of the target market for most law firms. Statistically, it&rsquo;s very likely that you are not taking full advantage of those possibilities. The good news is that &hellip; Continue reading \"The Elements of an Effective Law Firm Website\"","og_url":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2016-04-05T00:00:00+00:00","article_modified_time":"2019-11-25T21:15:15+00:00","og_image":[{"width":1200,"height":800,"url":"https:\/\/mlteaxgv3vr6.i.optimole.com\/mJASZg-J7ZphFWM\/w:1200\/h:800\/q:auto\/https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/04\/web-elements.jpg","path":"\/nas\/content\/live\/niftymarketing\/wp-content\/uploads\/2016\/04\/web-elements.jpg","size":"full","id":5456,"alt":"","pixels":960000,"type":"image\/jpeg"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"NiftyAdmin","Est. reading time":"16 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/04\/web-elements.jpg","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/04\/web-elements.jpg","width":1200,"height":800},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#webpage","url":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/","name":"The Elements of an Effective Law Firm Website - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#primaryimage"},"datePublished":"2016-04-05T00:00:00+00:00","dateModified":"2019-11-25T21:15:15+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/elements-effective-law-firm-website\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"The Elements of an Effective Law Firm Website"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/a80f8cbfe382709c4f312691ea7cea06","name":"NiftyAdmin","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7ff70b47217c9178ccbe3771aa54ddcb?s=96&d=mm&r=g","caption":"NiftyAdmin"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4559"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=4559"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4559\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media\/5456"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=4559"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=4559"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=4559"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}