{"id":4563,"date":"2016-09-13T00:00:00","date_gmt":"2016-09-13T00:00:00","guid":{"rendered":"https:\/\/niftymarketing.com\/legal-scholarship-study\/"},"modified":"2019-11-25T21:16:36","modified_gmt":"2019-11-25T21:16:36","slug":"legal-scholarship-study","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/legal-scholarship-study\/","title":{"rendered":"Effectiveness of Scholarship Link Building"},"content":{"rendered":"<p>&nbsp;<\/p>\n<h2>We Examined 10 Different Scholarship Campaigns To See How Effective Scholarships Really Are For Improving SEO. Here’s What We Found.<\/h2>\n<p>Sponsoring a scholarship has often been touted as a great way to improve the SEO of a law firm’s website. The logic behind this is that college websites (and to a lesser degree, high school websites) have more authority than the average website. Thus, getting links from these types of sites should bring more value and authority to your site, which should lead to improved rankings and an increase in organic traffic.<\/p>\n<p>However, theory doesn’t always equate to real life. That&#8217;s why we put our internal data here at Nifty to good use to examine the actual efficacy of scholarships on improving SEO. Beyond that, we found some non-conventional tactics for making the outreach process more efficient. Here are our findings:<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Summary of Findings<\/h3>\n<ul>\n<li>Scholarships are definitely a viable way of getting links. The average scholarship brings in <strong>a total of 47 links<\/strong>.<\/li>\n<li>Links from colleges have extremely high DA\/PA values, while high schools have much lower metrics (though they will be more locally relevant)<\/li>\n<li>When we compare traffic and rankings before starting a scholarship to the time after the scholarship ended, we do see increases in organic and total traffic.<\/li>\n<li>Maintaining and updating a list is one of the biggest keys to success<\/li>\n<li>Generic contact email addresses work significantly better than personal email addresses for college outreach<\/li>\n<li>Scholarships are becoming an overused tactic and it is going to become a lot harder to get links in the future.<\/li>\n<\/ul>\n<h2 style=\"font-size: 3.4em; text-align: center;\">Are Scholarships An Effective Tool For Improving SEO?<\/h2>\n<p>In order to gauge how effective scholarships are, we looked at a number of factors including: response rates, the average number of total links gained per scholarship, link quality, and how these scholarship links affect traffic and rankings after the scholarship is done and over.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Response Rate<\/h3>\n<p>Here we look at what kind of response you can expect to get from sponsoring a scholarship. Below are numbers depicting our average response rate and the number of links earned on average.<\/p>\n<h3 style=\"text-align: center; color: #2686b6;\">8.1%<\/h3>\n<p style=\"text-align: center;\">Total Response Rate<\/p>\n<h3 style=\"text-align: center; color: #2686b6;\">7.64%<\/h3>\n<p style=\"text-align: center;\">Total Success Rate<\/p>\n<h3 style=\"text-align: center; color: #2686b6;\">47<\/h3>\n<p style=\"text-align: center;\">Links Earned Per Scholarship on Average<\/p>\n<p>These numbers were calculated based on 10 scholarship campaigns we ran for clients across different states and legal specialties.<\/p>\n<p>Basically, we ended up receiving 8 responses (whether &#8216;yes&#8217; or &#8216;no&#8217;) for every 100 outreach emails we sent.<\/p>\n<p>We got nearly the same amount of live links, even though a significant portion of the email responses we got were &#8216;no&#8217;. The reason for this is that some schools ended up adding links to the scholarship, though they did not respond to our original outreach email.<\/p>\n<p>This really underscores the importance of monitoring for new links on a regular basis in order to get an accurate measurement of success.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Link Quality<\/h3>\n<p>Below is a breakdown of the Domain Authority (DA) for all of the links we successfully obtained from both high schools and colleges:<\/p>\n<h3 style=\"text-align: center;\">61<\/h3>\n<p style=\"text-align: center;\">Average DA of All Linking Sites<\/p>\n<h3 style=\"text-align: center;\">42<\/h3>\n<p style=\"text-align: center;\">Average DA of Linking High School Sites<\/p>\n<h3 style=\"text-align: center;\">72<\/h3>\n<p style=\"text-align: center;\">Average DA of Linking College Sites<\/p>\n<p>In the following graph, we break down the Page Authority (PA) of all links we got.<\/p>\n<h3 style=\"text-align: center;\">16<\/h3>\n<p style=\"text-align: center;\">Average PA of All Linking Sites<\/p>\n<h3 style=\"text-align: center;\">8<\/h3>\n<p style=\"text-align: center;\">Average PA of Linking High School Sites<\/p>\n<h3 style=\"text-align: center;\">24<\/h3>\n<p style=\"text-align: center;\">Average PA of Linking College Sites<\/p>\n<p>In conclusion, we see that many of the links obtained through scholarships have <i>really<\/i> high authority. The most authoritative links come from colleges, though there are a few high school websites with decent authority.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Scholarship Impact on Traffic<\/h3>\n<p>One of the biggest questions lawyers have is if sponsoring a scholarship will actually lead to increased traffic and rankings. The graph below illustrates overall traffic trends from when a scholarship begins to when it ends. As you can see, scholarship do increase traffic incredibly while it is running, though most of those visits are going to the scholarship page. You will usually see traffic peak in the final two months of the scholarship (usually April and May)<\/p>\n<p>Below is a graph that shows the beginning and ending of a scholarship. Here we see that in every case, organic traffic was higher after the end of the scholarship, than before the scholarship began.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Scholarship Impact on Rankings<\/h3>\n<p>When we look at rankings, we saw similar things that we did with organic traffic. They were higher after the scholarship ended than before the scholarship started. Now obviously, we didn’t do these scholarships in a vacuum. Still, it is very compelling to see these kinds of improvements in rankings over a 9-month period.<\/p>\n<p>The graph below is for a currently active scholarship. This graph is particularly compelling, as we saw really impressive gains after starting the scholarship for a few months. Beyond the scholarship, the only things we did were get a couple of guest blog links and adjust the URL and Title Tag.<\/p>\n<h2 style=\"text-align: center;\">Tips for a Successful Scholarship Campaign<\/h2>\n<p>Now that we’ve shown scholarships are a viable way of getting links and do improve traffic, it is time to dive into the different methods and techniques of outreaching for your legal scholarship<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Maintain a List<\/h3>\n<p>The first thing you’ll want to do is maintain a list of schools in your state. Wikipedia is a great way of getting a list of colleges.<\/p>\n<p style=\"text-align: center;\"><i>Wikipedia has lists of colleges for each US State.<\/i><\/p>\n<p>Some schools will have a strict no-linking policy. Make note of which schools those are and color code your list. The last thing you want is to outreach to the same school in the future and frustrate them further. We recommend using Google Sheets for maintaining your list since it&#8217;s available cross-platform and allows multiple people to update it.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Outreach to a Generic Email Address<\/h3>\n<p>Common wisdom says you should try and find a personal email address to outreach to. However, we found that generic email addresses (like financialaid@school.edu) perform a lot better for getting links than personal ones like janedoe@school.edu. This should make your prospecting process a lot easier.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Day &amp; Time of Day Don’t Really Matter<\/h3>\n<p>After going through our data, we didn’t find any particular day that performed better than another. Instead we found a bigger correlation with how long it took from initial outreach to get a response. As the chart below shows, <strong>most responses were given within two days<\/strong>.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Using an Accordion Application Can Help You Improve a Specific Page<\/h3>\n<p>Sometimes you want to boost up the authority of a particularly important page so that it ranks better. Thus, it would make sense to build more links to <i>that particular<\/i> page.<\/p>\n<p>One technique we found useful for this purpose is to embed the application on the page you are targeting.<\/p>\n<p>Obviously, this could detract from the rest of the content on-site. Thus, what we&#8217;d recommend is using an &#8216;accordion&#8217; function to hide the application until clicked on. Please refer to the animation below to get a sense of how it should work: If you do embed an accordion application on one of your targeted internal pages, you can use an &#8216;anchor&#8217; in the URL that you outreach with, so that people land directly on the application portion. If you go this route, the link should look like http:\/\/www.lawfirm.com\/important-page#scholarship-application.<\/p>\n<h2 style=\"font-size: 3.4em; text-align: center;\">Looking Towards the Future<\/h2>\n<p>In this last section, I’d like to discuss some of the trends we’ve started to see in recent months with scholarship outreach. It seems we are approaching a saturation point with colleges and scholarships.<\/p>\n<p>Any tactic has the potential to be overused. Consider, for example, infographics. In the past, creating any kind of infographic would usually result in tons of links. However, today, it is much harder to get links with infographics. What happened?<\/p>\n<p>I&#8217;d like to think of it as supply and demand. When there is a low supply of something (whether it be infographics or scholarships), there is a higher demand and value ascribed to it. However, as supply increases, demand decreases. Infographics used to be more valuable in 2010 because creating one required someone with a design background and someone who had expensive graphic programs. Nowadays, though, there has been a proliferation of tools that make creating an infographic so easy a high school freshman can do it. Examples of these newer tools and services include Piktochart, Canva, and Fiverr.<\/p>\n<p>This principle really underscores the importance of not chasing tactics endlessly, but on creating a strategy first and then using tactics to implement that strategy. The following sections will illustrate what I believe is compelling evidence that there is an over-supply of scholarships in today&#8217;s climate.<\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Colleges Are Becoming Overwhelmed<\/h3>\n<p>When we first started implementing scholarship linkbuilding campaigns in 2014, we got really great responses with our requests for links. However, since then we&#8217;ve seen a steady growth in &#8216;no&#8217; responses: Here are the major reasons schools declined to link to our client&#8217;s scholarship.<br \/>\nNow here is the most telling chart. This chart shows the growth of &#8216;no&#8217; responses due to the fact that schools &#8220;are getting too many requests.<\/p>\n<p>As you can see schools are indeed getting overloaded with requests. But if you&#8217;re still not convinced, consider the following before and after examples:<\/p>\n<p style=\"text-align: left;\"><em>The University of Wyoming used to include links on an actual page on their site. Now, however, they use the AcademicWorks platform to host scholarship opportunities.<br \/>\n<\/em><\/p>\n<p style=\"text-align: left;\"><em>Yale says they will no longer promote scholarships due to &#8216;lack of capacity&#8217;.<\/em><\/p>\n<p style=\"text-align: left;\"><em>Baylor University implemented a moratorium just three months after they put one link live.<\/em><\/p>\n<p><em>Drake said they will no longer add them on-site and instead recommend going to the major directories.<\/em><\/p>\n<p style=\"text-align: left;\"><em>The University of Washington said they are limiting which scholarships they will link to due to the overwhelming amount of requests.<\/em><\/p>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Getting Links is Getting Harder<\/h3>\n<p>Colleges are responding to the huge deluge of requests in one of four ways:<\/p>\n<ol>\n<li style=\"padding-bottom: .5em;\"><strong>Stopping linking altogether<\/strong>. These are the schools like Yale and Drake that are just stopping linking altogether. Some will say &#8216;sorry&#8217; and redirect you to the major directories like FastWeb. Others will just say &#8216;no&#8217;.<\/li>\n<li style=\"padding-bottom: .5em;\"><strong>Being selective of who they link to<\/strong>. Some colleges, like University of Washington, will limit which kinds of scholarships they will link to. This could mean only promoting scholarships targeting minorities or scholarships limited to a particular geographic region.<\/li>\n<li style=\"padding-bottom: .5em;\"><strong>Using third-party solutions<\/strong>. Some schools are turning to third-party solutions to help manage their scholarship lists. This usually means lower quality links. Common third-party solutions include Naviance, AcademicWorks, Facebook, or Google Sheets.<\/li>\n<li style=\"padding-bottom: .5em;\"><strong>Streamlined Submission Processes<\/strong>. A small amount of schools are streamlining their process for promoting scholarships. They are doing this by having an online form that scholarship providers can fill out to get their scholarship listed. Here is an example: <a href=\"https:\/\/www.umass.edu\/umfa\/scholarship\/post-a-scholarship\">https:\/\/www.umass.edu\/umfa\/scholarship\/post-a-scholarship<\/a><\/li>\n<\/ol>\n<h3 style=\"font-size: 2.4em; padding-bottom: 0.5em;\">Conclusions<\/h3>\n<p>In light of these trends, I think we can expect to see fewer links going to scholarships in the future, especially at the college level.<\/p>\n<p>It is worth experimenting with the rules of your scholarship and who you&#8217;re targeting. Some schools are very selective of the scholarships they list on their site. More creative and\/or &#8216;niched&#8217; scholarships have the potential for getting more links. For example, right now it seems there is a lower supply of minority-focused scholarships. Thus, these may perform well in the short-term.<\/p>\n<p>It&#8217;s important to keep in mind, though, that the more you niche your scholarship, the more likely it is <i>other<\/i> schools will reject your request. Also, it&#8217;s likely that as supply of these niche scholarships increase, universities will make new adjustments to counteract the influx.<\/p>\n<p>High schools are not facing the same pressures that colleges are. This is probably because of the sheer number of high schools compared to college. Thus, it might make sense to target more of your scholarships to high schools.<\/p>\n<p>However, as shown in this study, the metrics for linking high school sites are usually much lower. Beyond that, some high schools aren&#8217;t very diligent about maintaining their website and would much rather email out links, post them on a physical &#8216;scholarship board&#8217;, or just share them on Facebook. Finally, it&#8217;s possible that high schools will eventually become overwhelmed with requests too.<\/p>\n<p>Thus, I think the best approach for the near future is to continue outreaching to both colleges and high schools. The key is to maintain your list and find out which schools are streamlining their processes and focus on them. Work on ignoring the schools who have the propensity to say no.<\/p>\n<p>No matter what though, you should ensure that your scholarship is part of an overall strategy, and not just a singular tactic to get links.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; We Examined 10 Different Scholarship Campaigns To See How Effective Scholarships Really Are For Improving SEO. Here’s What We Found. Sponsoring a scholarship has often been touted as a great way to improve the SEO of a law firm’s website. The logic behind this is that college websites (and to a lesser degree, high &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/legal-scholarship-study\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Effectiveness of Scholarship Link Building&#8221;<\/span><\/a><\/p>\n","protected":false},"author":17,"featured_media":4634,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[85,54],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Effectiveness of Scholarship Link Building - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/legal-scholarship-study\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Effectiveness of Scholarship Link Building - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"&nbsp; We Examined 10 Different Scholarship Campaigns To See How Effective Scholarships Really Are For Improving SEO. Here’s What We Found. Sponsoring a scholarship has often been touted as a great way to improve the SEO of a law firm’s website. The logic behind this is that college websites (and to a lesser degree, high &hellip; Continue reading &quot;Effectiveness of Scholarship Link Building&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/legal-scholarship-study\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2016-09-13T00:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-25T21:16:36+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/mlteaxgv3vr6.i.optimole.com\/mJASZg-KDniBuP9\/w:1800\/h:1200\/q:auto\/https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1800\" \/>\n\t<meta property=\"og:image:height\" content=\"1200\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Amador Chavez\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/legal-scholarship-study\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg\",\"width\":1800,\"height\":1200},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/legal-scholarship-study\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/legal-scholarship-study\/\",\"name\":\"Effectiveness of Scholarship Link Building - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/legal-scholarship-study\/#primaryimage\"},\"datePublished\":\"2016-09-13T00:00:00+00:00\",\"dateModified\":\"2019-11-25T21:16:36+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/4bc7811634c78b845d0bf28482464569\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/legal-scholarship-study\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/legal-scholarship-study\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/legal-scholarship-study\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Effectiveness of Scholarship Link Building\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/4bc7811634c78b845d0bf28482464569\",\"name\":\"Amador Chavez\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/60d37d7bff74795f45d83ef71747b666?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/60d37d7bff74795f45d83ef71747b666?s=96&d=mm&r=g\",\"caption\":\"Amador Chavez\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Effectiveness of Scholarship Link Building - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/legal-scholarship-study\/","og_locale":"en_US","og_type":"article","og_title":"Effectiveness of Scholarship Link Building - Nifty Marketing","og_description":"&nbsp; We Examined 10 Different Scholarship Campaigns To See How Effective Scholarships Really Are For Improving SEO. Here’s What We Found. Sponsoring a scholarship has often been touted as a great way to improve the SEO of a law firm’s website. The logic behind this is that college websites (and to a lesser degree, high &hellip; Continue reading \"Effectiveness of Scholarship Link Building\"","og_url":"https:\/\/niftymarketing.com\/legal-scholarship-study\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2016-09-13T00:00:00+00:00","article_modified_time":"2019-11-25T21:16:36+00:00","og_image":[{"width":1800,"height":1200,"url":"https:\/\/mlteaxgv3vr6.i.optimole.com\/mJASZg-KDniBuP9\/w:1800\/h:1200\/q:auto\/https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg","path":"\/nas\/content\/live\/niftymarketing\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg","size":"full","id":4634,"alt":"","pixels":2160000,"type":"image\/jpeg"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"Amador Chavez","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/legal-scholarship-study\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2016\/10\/legal_scholarship_link_building.jpg","width":1800,"height":1200},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/legal-scholarship-study\/#webpage","url":"https:\/\/niftymarketing.com\/legal-scholarship-study\/","name":"Effectiveness of Scholarship Link Building - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/legal-scholarship-study\/#primaryimage"},"datePublished":"2016-09-13T00:00:00+00:00","dateModified":"2019-11-25T21:16:36+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/4bc7811634c78b845d0bf28482464569"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/legal-scholarship-study\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/legal-scholarship-study\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/legal-scholarship-study\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"Effectiveness of Scholarship Link Building"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/4bc7811634c78b845d0bf28482464569","name":"Amador Chavez","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/60d37d7bff74795f45d83ef71747b666?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/60d37d7bff74795f45d83ef71747b666?s=96&d=mm&r=g","caption":"Amador Chavez"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4563"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/17"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=4563"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/4563\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media\/4634"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=4563"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=4563"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=4563"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}