{"id":509,"date":"2010-03-23T12:33:14","date_gmt":"2010-03-23T12:33:14","guid":{"rendered":"https:\/\/niftymarketing.com\/?p=509"},"modified":"2018-04-05T17:39:03","modified_gmt":"2018-04-05T17:39:03","slug":"local-search-talk-series-part-1-miriam-ellis-interview","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/","title":{"rendered":"Local Search Talk Series Part 1: Miriam Ellis Interview"},"content":{"rendered":"<p>Over the past year I have gotten to know some great people in the local search space. Each one as taught me something through phone conversations, tweets, emails, or even a few I have been lucky enough to meet in person. So, in an effort to personally  learn more about everyone, and also to come to a consensus about a few things, I wanted to do some interviews. With that in mind,  I present to you the <strong>Local Search Talk Series<\/strong>. Over the next month I will be interviewing between 10-15 of the &#8220;thought leaders&#8221; in local search, and will be posting the interviews on my blog. Some of the questions will be given to everyone, and some will be specific for the individual since most have a certain focus in the local space.  At the end of the series I am going to do a recap for my <a title=\"My Super Cali Fragi Listic Local search Column\" href=\"http:\/\/www.searchenginejournal.com\/author\/mike-ramsey\/\">Search Engine Journal Local Column<\/a>.<!--more--><\/p>\n<p>First on the list is Miriam Ellis of Solas Web Design who specializes in <a href=\"http:\/\/www.solaswebdesign.net\/\">website design and local seo in the San Fransico Bay<\/a> area. I wanted to give Miriam the first spot because she gave me some great advice when I talked to her about doing this set of interviews, and also pioneered her own series of <a href=\"http:\/\/www.solaswebdesign.net\/wordpress\/?p=189\">local search interviews<\/a> in 2008 (which in internet doggy years is 2 decades ago).<\/p>\n<p><strong>How did you initially get involved with web design and internet marketing?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>When I got married, my husband and I decided we wanted to work together. In times past, husbands and wives worked side by side for the single goal of building a life for themselves and this idea appealed to us. My husband had been working as a web designer for a large company and I suggested it would be much more &#8216;fun&#8217; working for himself. He had faith in my suggestion and we took the jump. He taught me the basics and my background in fine arts added a special touch to the quality of the designs we could produce. We were sticklers about good SEO practices from day one. Over time,  I learned that I excel at working one-on-one with the clients. Because of this, our business model evolved so that I tend to be the front &#8216;man&#8217; for our business, while he handles a lot of the behind-the-scenes work. Then Local came along and I immediately got excited about it!<br \/>\n<strong><br \/>\nWhat made you loco for local?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>I&#8217;m a born romantic. I really get into the romance of small town life and the function of the small business owner in the quality of civic life. By helping people with Local Search, I get to make their town a little bit better, wherever they are in North America. I get to learn about places like North Truro, MA., Laramie, WY., and Bedford, VA. When I understood that learning the disciplines of Local would enable me to help communities do business more effectively, I loved that idea. And, because we focus on small business clients, we are fighting the good fight against the incursion of big box stores that rob little towns of their uniqueness and flavor. Local Search is Mom &amp; Pop&#8217;s chance to stay in business.<br \/>\n<strong><br \/>\nDo you have someone who has helped you along the way in learning local?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>I will eagerly cite Mike Blumenthal as my foremost influence in Local. Mike has helped me repeatedly, both through the publication of his blog and in one-on-one conversations.<br \/>\n<strong><br \/>\nNow given that you and your husband run Solas Web Design, can you tell us about your company, the challenges, and the triumphs that you have seen?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>I would say that the greatest on-going challenge for our business has been connecting with small business clients who have been disciplined enough in their approach to taking their business onto the web to set aside a realistic budget for the project. I still spend time just about every week talking to very nice folks who, unfortunately, have been lulled by get-rich-quick myths about doing business on the Internet and simply have yet to learn that doing serious business, offline or online, requires a serious investment of both time and money. This is challenging, because then it is up to me to educate them about this, suggesting that they consider saving up for a couple of months or even a year so that they can do things right. Very often, we don&#8217;t hear back from them and I&#8217;m left imagining that they decide to do things the hard way &#8211; going for the $9.99 template design deals that misleadingly encourage novices to believe they can build a website in an hour. Sure, they can do this, but unless time is spent learning about good design, SEO, Usability, Local, Marketing, etc. their chances for success are slim. The reason this bothers me is that they waste both time and money, and I don&#8217;t like to see this happening to small business owners. I want to see them succeed!<\/p>\n<p>In terms of triumphs, the <a title=\"Some Amazing Work By Miriam and Liam \" href=\"http:\/\/www.solaswebdesign.net\/clients.shtml\">testimonials on our portfolio pages<\/a> do a fine job of summing up our successes. We&#8217;ve taken e-commerce clients on and increased their profits by 400%, we&#8217;ve helped clients to reduce their dependence on Yellow Pages, and have helped small businesses to present themselves professionally. And, the great thing is, they are happy to write us little notes telling us this. To us, this is success: we&#8217;ve helped people.<\/p>\n<p><strong>In looking over your clients, you seem to work with some interesting niches like online guitar lessons, exotic teas, natural soaps, and custom pottery. How is internet marketing different when you deal with these types of projects?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>Yes, niches are our niche! While we are not, per se, Internet Marketers, in terms of Local Search Marketing, the process is relatively similar for all types of businesses. What is different, in my opinion, is the content of what you promoting. Large companies struggle to speak with a friendly voice to the public. Small businesses tend to already have that friendly voice built into their model. I just help them to find it!  Whether this comes into play in writing their business description in Maps, the content on their site and blog, or the scripts for their videos, marketing pretty much boils down to making the right connections with the right people in the right places.<br \/>\n<strong><br \/>\nYou are an accomplished acrylic paintress (I think I just made up that word). How has this aided you in your online business?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>It has helped with the visual aspects of doing website design. While function is the most important thing to me about any site we build, the handsomeness of a site is also key to a professional presentation. New clients come to us with no logo, no graphics, no idea of how they want to &#8216;look&#8217;. I can create all of this for them, from scratch, using on or offline media. I got to design the labeling for a complete line of children&#8217;s gardening seeds a few years ago for one client. Totally fun! I&#8217;ve done pen-and-ink work, painting and graphic design work for a ton of our clients over the years and I think the years I spent working as an artist prior to going into business with my husband have made all this seem natural to me. It&#8217;s just part of me to make things look good.<br \/>\n<strong><br \/>\nRecently, you became a proud owner of a Nexus One, how has that been treating you?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>I still am not quite over my initial excitement about this, Mike! I am still in the process of forming impressions about how the web looks when seen through the eyes of a mobile device. Some sites are a pleasure to use and others are a nightmare. This observation should help me in my next step &#8211; learning to design for mobile. I&#8217;m really looking forward to this. In the meantime, I just feel really cool going around with my Nexus and realizing that I can use it to call people, look up stuff, find things, no matter where I am. Pretty phenomenal.<\/p>\n<p><strong><br \/>\nWhat is your favorite, and least favorite, part about being a local seo consultant?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>Favorite: Having clients come back and tell me that since I worked with them, they are getting more calls and more business. I love that!<br \/>\n<strong><br \/>\n<\/strong>Least Favorite: Dealing with the vagaries of monopolistic web entities (okay, I&#8217;m talking about Google) on behalf of small business owners. The practice of Local often involves taking Mom &amp; Pop into the big business world, and having to deal with life-altering policies, bugs and an overall lack of accountability and transparency makes my work a bit stressful. When doing web design, I am fully accountable for the end product. When doing Local Search Marketing, Google, Yelp, CitySearch, somebody else holds the keys. I can&#8217;t vouch for what will happen and I&#8217;d love to see the day when I can. It would be a more confident situation for everyone involved.<br \/>\n<strong><br \/>\nWhat do you do in your free time&#8230;if you have any?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>The majority of my time spent offline, I&#8217;m farming. We have an organic microfarm that we are earnestly working on to feed our family the most delicious food on the face of the earth. If that sounds like an exaggeration, I wish you&#8217;d been here for lunch yesterday eating our first new potatoes and snow peas. A great portion of my time deals with growing food, cooking it and eating it. Basic but beautifully satisfying. Other than this, I&#8217;m a voracious reader, love to sew, love birding, playing the Native American flute and piano, writing, praying, singing, working to promote green living and spending as much possible time out in the natural world as I can. I am happiest there. I feel like I spend a lot of time laughing. I don&#8217;t know what it is about my marriage, but Liam and I seem to invest a lot of time in cracking up.<br \/>\n<strong><br \/>\nIn your opinion, what do you think is the biggest challenge facing local search?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>This is a tough question, actually. My belief is that Google, as the major player in Local, went about creating their index incorrectly. Rather than engaging business owners, they simply swiped and aggregated their information. This has led to a botched index and business owner confusion and rage. It&#8217;s probably too late in the game to go back to square one with this and make an honest, meaningful opt-in outreach to business owners, but I&#8217;m afraid that the legacy of Google&#8217;s choice is a world of Local Search built on a faulty foundation. Now, we have to do things backwards. The business owner has to come looking for Google to ensure that he is not being misrepresented. This is not a situation that creates a happy atmosphere in Local. I wish it were otherwise.<\/p>\n<p>My own pet peeve with Local is that Google has yet to incorporate a meaningful way for the address-less local businesses to participate in Local. According to studies I&#8217;ve seen, home-based businesses comprise some 50% of U.S. commerce. <strong>50%!<\/strong> Many of these businesses do not want their address published because of privacy concerns or because they simply don&#8217;t do business this way. Then there are all of the go-to-client business models like in-home elder care providers, chimney sweeps and the like. Google has cut off its right hand cutting these people out of the game. However, I&#8217;ve heard a Twitter rumor that Google is about to find a solution to this. I am so hoping it&#8217;s a good one!<\/p>\n<p><strong> Can you give us an idea of what you think 2010-2011 hold in store for Local Search?<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p>Local and Social will become more inextricably linked and investment in Local will likely continue to grow. I think these trends will just continue to snowball. Most importantly, more and more business owners will hear of Local and this will mean greater participation which will engender new creativity and opportunities being created in this sphere. All good stuff!<br \/>\n<strong><br \/>\nWhat is the best advice you would give someone who is wanting to learn about local seo?<\/strong><\/p>\n<p><strong> <\/strong><br \/>\nFind the people who are writing best about Local and put them in your feedreader and start following them on Twitter, Facebook, etc. Read, read, read. Get your hands on at least one Local account (maybe belonging to a friend or relative) and start playing with it. Take action and then take note of the results of each action. Get your hands on a second account in a different industry and start at step one again. A combination of on-going reading and hands-on practice will be your best teachers.<\/p>\n<p><strong>Thanks A ton Miriam. Great answers and I want to thank you for sound advice and kind words that you have given to me over the past year. You can find More on Miriam by following her <a href=\"http:\/\/www.solaswebdesign.net\/wordpress\/\">SEO Igloo Blog<\/a>.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over the past year I have gotten to know some great people in the local search space. Each one as taught me something through phone conversations, tweets, emails, or even a few I have been lucky enough to meet in person. So, in an effort to personally  learn more about everyone, and also to come &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Local Search Talk Series Part 1: Miriam Ellis Interview&#8221;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[52],"tags":[112],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Local Search Talk Series Part 1: Miriam Ellis Interview - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Local Search Talk Series Part 1: Miriam Ellis Interview - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"Over the past year I have gotten to know some great people in the local search space. Each one as taught me something through phone conversations, tweets, emails, or even a few I have been lucky enough to meet in person. So, in an effort to personally  learn more about everyone, and also to come &hellip; Continue reading &quot;Local Search Talk Series Part 1: Miriam Ellis Interview&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2010-03-23T12:33:14+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-04-05T17:39:03+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mike Ramsey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/\",\"name\":\"Local Search Talk Series Part 1: Miriam Ellis Interview - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"datePublished\":\"2010-03-23T12:33:14+00:00\",\"dateModified\":\"2018-04-05T17:39:03+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Local Search Talk Series Part 1: Miriam Ellis Interview\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76\",\"name\":\"Mike Ramsey\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g\",\"caption\":\"Mike Ramsey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Local Search Talk Series Part 1: Miriam Ellis Interview - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/","og_locale":"en_US","og_type":"article","og_title":"Local Search Talk Series Part 1: Miriam Ellis Interview - Nifty Marketing","og_description":"Over the past year I have gotten to know some great people in the local search space. Each one as taught me something through phone conversations, tweets, emails, or even a few I have been lucky enough to meet in person. So, in an effort to personally  learn more about everyone, and also to come &hellip; Continue reading \"Local Search Talk Series Part 1: Miriam Ellis Interview\"","og_url":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2010-03-23T12:33:14+00:00","article_modified_time":"2018-04-05T17:39:03+00:00","twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"Mike Ramsey","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/#webpage","url":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/","name":"Local Search Talk Series Part 1: Miriam Ellis Interview - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"datePublished":"2010-03-23T12:33:14+00:00","dateModified":"2018-04-05T17:39:03+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"Local Search Talk Series Part 1: Miriam Ellis Interview"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76","name":"Mike Ramsey","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g","caption":"Mike Ramsey"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/509"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=509"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/509\/revisions"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=509"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=509"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=509"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}