{"id":5641,"date":"2018-07-30T08:10:37","date_gmt":"2018-07-30T08:10:37","guid":{"rendered":"https:\/\/niftymarketing.com\/?p=5641"},"modified":"2021-05-25T10:18:05","modified_gmt":"2021-05-25T16:18:05","slug":"the-marketers-guide-to-navigating-copyrights-for-image-usage","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/","title":{"rendered":"The Marketer’s Guide to Navigating Copyrights For Image Usage"},"content":{"rendered":"<p><span class=\"Apple-converted-space\"><span style=\"font-weight: 400;\">When I’m trying to come up with ideas for content development, I like to let Google autocomplete variations of phrases with keywords related to my subject matter. Doing this helps me understand the types of questions people are searching for regarding a particular topic. This is also a great way to develop FAQ content ideas for your website. While researching topics to cover about copyright issues &amp; trying to dial into common concerns, I came across some interesting questions that Google autocomplete showed me people are searching. As you can see from the autocomplete variations below, there are a lot of people concerned about various aspects of copyright infringement. A fair amount of these searches are generated from people trying to better understand copyright laws &amp; how they apply to what they are currently doing in their business or on their websites, such as how they are using imagery. Others are related to obtaining &amp; enforcing copyrights for creative works, and even how to dodge particular copyright issues.<\/span> <\/span><\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-4575\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/AutocompleteScreenshots.jpg\" alt=\"\" width=\"1200\" height=\"294\" \/><span style=\"font-weight: 400;\">After looking through many variations of autocomplete suggestions like these, it seems that many more people are searching how to avoid  problems with copyrights laws than those who are searching for how to enforce them. This could lead one to believe that there is a relatively small number of people scaring the hell out of a much larger group of people with the threat of some type of action against them. And, for good reason. Nobody wants to end up in a legal battle over the use of an image on a blog post. Looking further into the keyword volume, there are actually quite a few people looking for information on how to obtain a copyright for different creative works. This won’t be the focus of this post, but we’ll also briefly touch on a couple points in relation to that in the Q&amp;A section.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-4577 size-full\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/How-to-get-copyright-keywords.png\" alt=\"\" width=\"819\" height=\"254\" \/><span style=\"font-weight: 400;\">The real focus here is on “how to avoid copyright infringement”, which a fair amount of people are also interested in and searching for (&amp; probably many more long-tail variations).<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-4578 aligncenter\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/Avoiding-copyright-infringement-keyword.jpg\" alt=\"\" width=\"849\" height=\"39\" \/><span style=\"font-weight: 400;\">So how do you avoid copyright infringement? The best rule of thumb I’ve learned up to this point is to <strong>assume everything is under copyright protection unless specifically stated that it is not<\/strong>. There’s a lot of widely held assumptions that you can use images in certain places and under certain circumstances, but many of these assumptions are simply false. Let’s look at a few more general rules you can follow that should help you avoid lawsuits &amp; headaches down the road.<\/span><\/p>\n<h2><b>1. Know if you have permission<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">If you don’t know for sure if you have permission to use an image, and it’s not specifically stated somewhere that the image is for commercial use and\/or royalty free, don’t use it. It’s not worth the potential risk. Some <\/span><a href=\"http:\/\/www.shiftcomm.com\/blog\/copyright-101-basics-avoiding-content-marketing-lawsuits\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">basic things about copyright law<\/span><\/a><span style=\"font-weight: 400;\"> you should understand are:<\/span><\/p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Copyright is automatic and when someone produces a creative work, ordinarily copyright applies.<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">For further protection under the law, the creator of the work can register that work with the copyright office.<\/span><\/li>\n<li style=\"font-weight: 400;\">The existence or nonexistence of the <a href=\"https:\/\/www.copyright.gov\/circs\/circ01.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">copyright symbol<\/a> is not required nor does it mean that the copyright has not been registered at the U.S. Copyright Office.<\/li>\n<\/ol>\n<h2><b>2. Understand that most of what you do will likely be commercial in nature<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">As a marketer, pretty much everything you do for your own business (and for your clients) will be commercial in nature. It’s likely not worth trying to decipher if <\/span><a href=\"https:\/\/www.copyright.gov\/fair-use\/more-info.html\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Fair Use<\/span><\/a><span style=\"font-weight: 400;\"> might apply when it comes to using copyrighted information because more than likely, it won’t. There are exceptions to this, but even the exceptions are subject to a court&#8217;s interpretation of the copyright when deciding if the use was &#8220;fair&#8221; For example, using copyrighted elements in something like an infographic may be considered a &#8220;transformative&#8221; work because it takes on a new meaning &amp; use. But even then, the amount of copyrighted work within it as well as a number of other factors would likely be considerations made by a court. This is why it’s better to err on the side of caution when it comes to commercial use of anything which you suspect may be copyrighted content.<\/span><\/p>\n<h2><b>3. Utilize stock imagery<span class=\"Apple-converted-space\"> <\/span><\/b><\/h2>\n<p><span style=\"font-weight: 400;\">The safest imagery you can use (outside of images you’ve shot or created yourself) will most likely come from paid stock sites. Using stock images can help you avoid costly legal fees related to copyright issues. Stock media companies have a financial interest in keeping their customers safe from ungrounded copyright claims. Obviously, it’s not good for their business if people try to start copyright lawsuits against people who’ve legally obtained &amp; paid for stock media, so it’s in their best interest to protect their customers. <strong>This is done through agreements with the photographers &amp; creatives that work with them &amp; produce the media for sale on their sites.<\/strong> Some of my personal favorite stock sites include: <\/span><a href=\"https:\/\/www.colourbox.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Colourbox<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/www.istockphoto.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">iStock<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/www.shutterstock.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Shutterstock<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h2><b>4. Exercise more caution with free images<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">When using any free image sites, make sure that the image is free for commercial use, and\/or <a target=\"_blank\" href=\"https:\/\/pikwizard.com\/blog\/what-does-royalty-free-mean?utm_source=blog&#038;utm_medium=content%20link&#038;utm_campaign=PW%20what%20does%20royalty%20free%20mean\" rel=\"noopener\">royalty free<\/a> &amp; also be positive that you are attributing correctly if it is required for use. You may want to lean away from usage that does require attribution if you feel it diminishes the professional quality of the use to have the attribution with the image (some requirements vary). If you do use free imagery from anywhere, you should consider <strong>documenting some things as a precaution<\/strong> just in case something were ever to come up from usage of the image:<\/span><\/p>\n<p><span style=\"font-weight: 400;\">a). <strong>Document the url<\/strong> where the image was available for download.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">b). <strong>Document the date<\/strong> you found the image available.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">c). <strong>Catalog this documentation<\/strong> in a way that will be easy to find &amp; sort through at a later date if ever needed. If you’re doing this for many clients on a regular basis, things can get quite messy pretty quickly.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">d). <strong>Remember that different sites have different rules<\/strong> for image use. Flickr’s <\/span><a href=\"https:\/\/www.flickr.com\/people\/free_for_commercial_use\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Free For Commercial Use license<\/span><\/a><span style=\"font-weight: 400;\"> still requires attribution. And no, not all images on Flickr are okay to reuse.<\/span><\/p>\n<h2><b>5. Check licensing details<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Even though stock images are a safer bet for image use, just because you’re downloading images a stock site and paying for the image, does NOT guarantee that you can do anything you want with them. You especially need to be aware of each site’s licensing terms &amp; understand what type of use each license allows. Most stock image sites also have a large number of “editorial’ images (sometimes more than not) which are not suitable for commercial purposes. This is an detail to pay attention to when using stock images. Here’s some things to to help decipher what licensing usage is available on a few stock image sites: <\/span><\/p>\n<h4><b>iStock:<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Once you click on an image you’re considering purchasing, here’s how to tell if the image is defaulted to the standard license or if it is for editorial use only:<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-4585 aligncenter\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/Istock-Licenses.jpg\" alt=\"\" width=\"1000\" height=\"434\" \/><\/p>\n<h4><b>Shutterstock:<\/b><\/h4>\n<p><span style=\"font-weight: 400;\">Again here’s where to look for standard license vs editorial use (only after clicking on an image)<\/span>:<\/p>\n<h4><b><img loading=\"lazy\" class=\"size-full wp-image-4583 aligncenter\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/Shutterstock-Editorial.jpg\" alt=\"\" width=\"1000\" height=\"343\" \/>Colourbox: <\/b><\/h4>\n<p><span style=\"font-weight: 400;\">When you click on an image to download on Colourbox, this is what is shown to the right side of that image and how you can tell between the licensing options<\/span>:<\/p>\n<p><b><img loading=\"lazy\" class=\"size-full wp-image-4584 aligncenter\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/ColorBox-Licenses.jpg\" alt=\"\" width=\"1000\" height=\"581\" \/><\/b><\/p>\n<p><span style=\"font-weight: 400;\">All three of these sites show this information to the right when clicking on the image you intend to download.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Most sites will specify somewhere what their licenses mean but may require some researching. For example, Colourbox outlines what <\/span><a href=\"https:\/\/www.colourbox.com\/faq#S_what_is_editorial_material\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">editorial images can be used for here<\/span><\/a><span style=\"font-weight: 400;\">. They also go into some detail about what can and cannot be defined as <\/span><a href=\"https:\/\/www.colourbox.com\/supplier-wiki\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">“royalty free” here<\/span><\/a><span style=\"font-weight: 400;\">. I would highly recommend anyone <a href=\"https:\/\/niftymarketing.com\">involved in marketing<\/a>, design or <a href=\"https:\/\/niftymarketing.com\/services\/local-seo-services\/\">seo<\/a> to take a look at that last link. It discusses a number of things I believe most of us would find surprising such as things which cannot ever be photographed or reproduced for any purpose besides editorial use.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some sites have ways the user can filter for stock or editorial images during a search, but be careful to still check the license on every image, as these searches can be misleading. For example, Colourbox has a section for stock and another for editorial. Selecting “stock” does NOT eliminate editorial. Rather, it just includes editorial <\/span><i><span style=\"font-weight: 400;\">and<\/span><\/i><span style=\"font-weight: 400;\"> royalty free images in the search. Selecting editorial refines the search to only editorial.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-4588 alignleft\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/Colourbox-Search.jpg\" alt=\"\" width=\"988\" height=\"306\" \/><span style=\"font-weight: 400;\">Shutterstock seems to function similarly to Colourbox, whereas, on iStock, refining the search to “creative” does seem to weed out editorial images. It is still wise, however, to not just rely on this entirely and to check each image license to be sure.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-4587 aligncenter\" src=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/05\/Istock-Creative-1.jpg\" alt=\"\" width=\"1000\" height=\"518\" \/><\/p>\n<p><span style=\"font-weight: 400;\">There are also limitations to most licensing. For example, a regular license may only cover a certain amount of views or specified amount of time. Some sites offer extended licenses for further freedoms of image usage. For example, iStock requires an <\/span><a href=\"https:\/\/www.istockphoto.com\/help\/licenses\" target=\"_blank\" rel=\"noopener noreferrer\"><i><span style=\"font-weight: 400;\">Extended License<\/span><\/i><\/a><span style=\"font-weight: 400;\"> for any physical products or items for sale (like posters, postcards, mugs, t-shirts) and also require an <\/span><i><span style=\"font-weight: 400;\">Unlimited Reproduction License<\/span><\/i><span style=\"font-weight: 400;\"> for things that may be copied many times over (like newspapers, magazines or books). So, by that logic, if we were to use an image for an ebook cover, we’d probably need something more than the <\/span><i><span style=\"font-weight: 400;\">Standard License<\/span><\/i><span style=\"font-weight: 400;\">. Even then, this wouldn’t cover <\/span><a href=\"https:\/\/www.istockphoto.com\/legal\/license-agreement\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">image use in a logo design<\/span><\/a><span style=\"font-weight: 400;\">. Shutterstock seems to be a bit more lenient with the <\/span><a href=\"https:\/\/www.shutterstock.com\/license\" target=\"_blank\" rel=\"noopener noreferrer\"><i><span style=\"font-weight: 400;\">Standard License<\/span><\/i><\/a><span style=\"font-weight: 400;\"> as they do specifically state that it covers books &amp; e-books as long as the audience or reproduction is 500k or less. It does prohibit things like templates or use in ways that would be considered reselling. Shutterstock’s <\/span><i><span style=\"font-weight: 400;\">enhanced license<\/span><\/i><span style=\"font-weight: 400;\"> is significantly more expensive but does offer further legal protection &amp; unlimited reproductions as well as the ability to make templates &amp; use images in some ways that would be considered “reselling” (such as greeting cards, magnets, textiles, etc., items that are not a single image use but rather where the image is utilized to sell another product).<\/span><\/p>\n<h3><b>Still Have Questions?<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">So, there are some of the basics as I understand them from my own research, though I’m by no means a legal expert on this topic. You should do your own due diligence &amp; make sure you understand the legalities of exactly how you intend to use material that isn’t of your own creation to avoid copyright issues. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The information covered above is really just the tip of the iceberg. You may still have a lot of unanswered questions &#8211; I know I did after doing a fair amount of research into the subject. But let’s see if we can answer a few more of those questions with some insight from some real experts: <\/span><b>intellectual property lawyers<\/b><span style=\"font-weight: 400;\">.<\/span><\/p>\n<div id=\"answers\">\n<h2><b>FAQs Answered by Intellectual Property Lawyers<\/b><\/h2>\n<\/div>\n<p><b>Disclaimer:<\/b><span style=\"font-weight: 400;\"> The information below is NOT to be taken as legal advice. While these questions are answered by actual attorneys, the exact details of your situation will vary from these. If you have a legal issue, consult with an attorney about the specifics of your situation.<\/span><\/p>\n<h4><b>General Copyright Questions:<\/b><\/h4>\n<ol>\n<li><span style=\"font-weight: 700;\">How much does commercial use come into play with Fair Use? I’ve seen claims that it’s significant &amp; also that it’s not necessarily. &#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>Quite a bit<\/i><\/b><i><span style=\"font-weight: 400;\">, but maybe not for why you think. Commercial use is one of the things a judge would consider in a Fair Use analysis, but whether or not it was commercial isn’t going to answer the underlying question of infringement. Whether a use is commercial or not will likely mean much more to the copyright holder. Meaning, someone is reasonably going to be more upset if someone else is selling prints of their artwork than they will be if someone is showing the same piece on their personal blog.”<\/span><\/i><span style=\"font-weight: 400;\">  <\/span><b>– Answered by Steve O’Donnell of<\/b> <a href=\"http:\/\/3cpatents.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>3C Patents<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Are there any significant differences on how copyright laws are handled per state? &#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><i><span style=\"font-weight: 400;\">Copyright law in the United States is governed by a federal statute. And under that statute, copyright law is exclusively the jurisdiction of the federal government. For this reason, <\/span><\/i><b><i>states do not have their own copyright laws<\/i><\/b><i><span style=\"font-weight: 400;\"> – if they did, their laws would be voided by the federal statute.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by David M. Lilenfeld of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Fair Use: is there any rule of thumb to go by as to where is the line drawn with fair use when it is for a commercial purpose <\/span><b>&#8211; <\/b><b><i>“<\/i><\/b><b><i>Fair use under copyright law is a legal defense to the copying of a protected work.<\/i><\/b><i><span style=\"font-weight: 400;\"> The fair use defense, though, is infrequently applied when the infringer is engaged in a commercial transaction (i.e., in a for-profit undertaking). The fair use defense is mostly reserved for copying done for the purpose of commentating, critiquing or parodying. One exception where fair use can apply to a commercial transaction is selling a t-shirt that contains a parody. For example, a political activist used the Walmart design on a t-shirt he sold. Under the Walmart design, wrote “Low Wages, Low Morals.” This use of the Walmart design was found to be fair use even though he sold the t-shirts.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211;<\/span> <b>Answered by David M. Lilenfeld of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">If something has not been registered, how likely is it that someone suing over copyright violation will obtain money for damages, does it really make any difference (if it has already been registered)? &#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>An owner of a work cannot file a lawsuit for copyright infringement until the work is registered with the Copyright Office<\/i><\/b><i><span style=\"font-weight: 400;\"> (or unless he\/she filed a registration application, but registration was refused by the Copyright Office). Also, an owner of a work can only be awarded monetary damages for copyright infringement that occurs after that work is registered. So, for example, let&#8217;s say copyright infringement began on February 1 and ended on June 1. If the infringed work was not registered until May 1, the owner is only entitled to monetary damages for the period of May 1 to June 1.”<\/span><\/i> <span style=\"font-weight: 400;\">&#8211;<\/span> <b>Answered by David M. Lilenfeld of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">How much does a copyright notice really matter for either someone using the media in question or owning it? <\/span><span style=\"font-weight: 400;\">&#8211; <\/span><i><span style=\"font-weight: 400;\">“A copyright notice is meant to inform the public that the work is protected by copyright, identify the owner and show the year the work was first published. A copyright notice can be placed on works that are registered or not registered. If a copyright notice is placed on a work, the infringer of that work cannot claim to be an “innocent infringer.” Other than that, the copyright notice mostly has a deterrent effect, rather than a legal one.”<\/span><\/i> <span style=\"font-weight: 400;\">&#8211;<\/span> <b>Answered by David M. Lilenfeld of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">If you’re hired to create something (such as a logo), do you have no claims to the copyright of that material? (reference here: <\/span><a href=\"https:\/\/www.sessions.edu\/notes-on-design\/ten-copyright-myths-that-can-hurt-you\/\"><span style=\"font-weight: 400;\">https:\/\/www.sessions.edu\/notes-on-design\/ten-copyright-myths-that-can-hurt-you\/<\/span><\/a><span style=\"font-weight: 400;\">) <\/span><span style=\"font-weight: 400;\">– <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>This all depends on the contract.<\/i><\/b><i><span style=\"font-weight: 400;\"> Generally if there&#8217;s a contract, transferring ownership only happens if the contract says so but it can vary depending on the circumstances. This, is why it&#8217;s much better to specify who owns rights within a contract. It can become a battle either way if no contract is drawn up.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by Michael J. Feigin, Esq. of<\/b> <a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Is there any grace period for mistakes between DMCA takedown requests before fines can incur? For instance, if you mistakenly thought something was free use, or Fair Use applied, &amp; the owner requests takedown &amp; payment of a fee immediately, is this commonplace &amp; completely within their legal rights? &#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><i><span style=\"font-weight: 400;\">There is no such “grace period.” Either the copying is protected by one of DMCA’s safe harbors, or it is not. Of course, a person who mistakenly copies a work (for example, because he\/she believes that work is in the public domain) would likely be subject to lesser monetary damages than someone who knows he\/she is infringing. Similarly, if a work is copied but promptly taken down once the infringement is discovered, less monetary damages would likely apply here also.”<\/span><\/i><span style=\"font-weight: 400;\">  <\/span><span style=\"font-weight: 400;\">&#8211;<\/span> <b>Answered by David M. Lilenfeld of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">One of the big claims with Fair Use is leveraging it for parody, can this still be done even if it’s for commercial purpose? How murky is that water to navigate? <\/span><span style=\"font-weight: 400;\">&#8211; <\/span><i><span style=\"font-weight: 400;\">”The big parody case concerns a commercial use. <\/span><\/i><a href=\"https:\/\/en.wikipedia.org\/wiki\/Campbell_v._Acuff-Rose_Music,_Inc\"><i><span style=\"font-weight: 400;\">https:\/\/en.wikipedia.org\/wiki\/Campbell_v._Acuff-Rose_Music,_Inc<\/span><\/i><\/a><i><span style=\"font-weight: 400;\">. so it’s certainly available for commercial claims. The big trick to using it is knowing the difference between parody and satire and how they’re treated differently. For example, in the Too Live Crew case, the use of the copyrighted work was to poke fun of the work itself and the antiquated sexual norms (at least that’s how the Court took it) so that’s parody. On the other hand, if I take the same work and twist the lyrics so I’m making fun of a politician, that’s more likely to be satire since I’m making fun of someone or something different from the copyrighted work itself. It’s very easy to get this wrong.”<\/span><\/i> <b>– Answered by Steve O’Donnell of<\/b> <a href=\"http:\/\/3cpatents.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>3C Patents<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">If you do accidentally or unknowingly infringe upon someone’s copyrights &amp; you get a DMCA notice and\/or fine request, what should you do? <\/span><span style=\"font-weight: 400;\">&#8211; “<\/span><i><span style=\"font-weight: 400;\">The great thing about a DMCA notice is that the rights holder can quickly get infringing content off of a website without having to go through the costly process of suing the infringer.  If you are a recipient of a DMCA take down notice, and you did infringe on the copyrighted work (knowingly or unknowingly) then the easiest thing to do is: nothing. Don&#8217;t respond to the notice and the platform provider will remove the post and the issue will be typically be resolved.  Note that the copyright owner could theoretically still sue you for the infringement but it will probably be satisfied with the take down. On the other hand, if you think you should not have to take the content down, then you need to respond to the take down notice with your own counter-notice.  The copyright owner would then have to sue you in order to get you or the platform to take the content down.” <\/span><\/i><span style=\"font-weight: 400;\">&#8211; Answered by <\/span><b>Daliah Saper of <\/b><a href=\"https:\/\/saperlaw.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Saper Law<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Is there a way to verify a specific image actually is part of a collection of copyrighted (and registered) work? How do you compare a copyright registration number or verify that a single image is actually part of that registered work if you can’t find it anything beyond the matching numbers of registration when searching: https:\/\/cocatalog.loc.gov ? <\/span><span style=\"font-weight: 400;\">&#8211;<\/span><i><span style=\"font-weight: 400;\"> “The best way to search the Copyright Office catalogs and records (for works published after 1978) is through the Copyright Office’s online catalog located at: https:\/\/cocatalog.loc.gov. However, a search of the online catalog is limited in the case of compilations or collections of copyrighted works. Individual works that were published as contributions to a compilation are usually not listed separately by title in the Copyright Office’s records and deposits (which are copies of the copyrighted works provided to the Copyright Office) are not open to the public for searching. So, in order to verify that a single image is part of the registered compilation, a person would need to either: (1) visit the copyright card catalog, which is located in the Copyright Public Records Reading Room (LM-404) on the fourth floor of the James Madison Memorial Building of the Library of Congress, and pay a search fee to review the deposit submitted as part of the compilation’s registration, or (2) request a member of the Copyright Office staff search the copyright records for you. An hourly fee is charged for searches conducted by the Copyright Office staff who will provide you with a factual report. To initiate a search you may consult the staff member on duty when you visit the Office, complete the form available at www.copyright. gov\/forms\/search_estimate.html, or contact the Copyright Office at: Library of Congress Copyright Office–IRD Records Research and Certification Section 101 Independence Avenue SE Washington, DC 20559 fax: (202) 252-3485 tel: (202) 707-6850.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by Kaitlyn Haase of<\/b> <b><a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Lilenfeld PC<\/a><\/b><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">My understanding is that “processes &amp; systems” are not copyrightable, how does that apply to written works explaining that process &amp; system? For example, if I write out a process &amp; someone takes my <i>exact<\/i> steps &amp; does a write-up but explains it with different words, is that completely fine &amp; legal or approaching murky waters? <\/span><span style=\"font-weight: 400;\">&#8211; “<\/span><i><span style=\"font-weight: 400;\"><b>Depends.<\/b> Something like this comes up with recipes from time to time. Your grandma’s chocolate chip cookie recipe may be the greatest ever, but it can’t be copyrighted, even if there are some unusual steps in there….maybe letting the dough rest overnight in the fridge and letting it come to room temperature before cooking, whatever. So, if you put the recipe in a cookbook, anyone can steal it, rewrite and rename it, and put it in their cookbook. If you also write up something telling a story of how you grandma made cookies when you were sick…that story is probably copyrighted. Copyright doesn’t cover useful things, so the recipe itself and instructions on how to make the recipe aren’t covered, but additional artistic flourishes added to the instructions are probably covered.”<\/i><\/span>  <b>– Answered by Steve O’Donnell of<\/b> <a href=\"http:\/\/3cpatents.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>3C Patents<\/b><\/a><\/li>\n<\/ol>\n<h4><b>Dispelling Copyright Myths:<\/b><\/h4>\n<ol>\n<li><span style=\"font-weight: 700;\">If there’s not copyright mark, it isn’t copyrighted. <\/span><b><i>“False.<\/i><\/b> <i><span style=\"font-weight: 400;\">The copyright symbol puts people on notice but is not required in the U.S. anymore. Displaying the copyright symbol can make a case easier to win &amp; allow you to get higher damages (enhanced damages) because it proves the violating part had knowledge of the copyright. Willful violation of a copyright grants the copyright owner much higher damages. It also helps so violators can&#8217;t easily claim they didn’t know about the copyright.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by Michael J. Feigin, Esq. of<\/b> <a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">If it hasn’t been registered to the Copyright Office, no copyright can be claimed. <\/span><span style=\"font-weight: 400;\">– <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>False.<\/i><\/b><i><span style=\"font-weight: 400;\"> You can use\/claim copyright without filing anything, but damages are much more limited without a copyright registration.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by Michael J. Feigin, Esq. of<\/b> <a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">If it’s not for commercial intent, there’s really nothing to worry about when reusing images. <\/span><span style=\"font-weight: 400;\">&#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>False.<\/i><\/b><i><span style=\"font-weight: 400;\"> You can definitely be sued for infringement when it&#8217;s not for commercial use. For example, downloading movies is typically just for personal use &amp; there&#8217;s been a number of (successful) lawsuits filed for this.”<\/span><\/i> <b>&#8211; Answered by<\/b> <b>Michael J. Feigin, Esq. of <\/b><a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">There’s no room for argument or challenge if someone claims copyright to something. <\/span><span style=\"font-weight: 400;\">&#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>False.<\/i><\/b><i><span style=\"font-weight: 400;\"> We live in America &amp; you can challenge someone or sue for almost anything. That doesn&#8217;t mean you&#8217;ll win though. However, the claim could be fraudulent, Holding a copyright certificate doesn’t always mean they for sure have the right to hold it or it either. Something could have been overlooked, someone could have filed for copyright over someone else&#8217;s creative work, etc.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by<\/b> <b>Michael J. Feigin, Esq. of<\/b> <a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">If an agency is hired to do some type of <a href=\"https:\/\/niftymarketing.com\/law-firm-web-design\/\">design work<\/a> &amp; gains usage rights (like with stock photography) that is transferred to the end client because they paid money for the work. &#8211; <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>False.<\/i><\/b> <i><span style=\"font-weight: 400;\">They typically are only licensed for use of the work but that usually doesn’t transfer.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by<\/b> <b>Michael J. Feigin, Esq. of<\/b> <a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Sending yourself a copy in the mail proves copyright.  <\/span><span style=\"font-weight: 400;\">&#8211;<\/span> <b><i>“False.<\/i><\/b><i><span style=\"font-weight: 400;\"> It may help prove that you created work at a certain date, but you still should file for copyright. Without registering, you may only be entitled to limited damages per individual &amp; per use but those damages can get much higher when work is registered (around $750+ per occurrence).”<\/span><\/i> <span style=\"font-weight: 400;\">&#8211; <\/span><b>Answered by<\/b> <b>Michael J. Feigin, Esq. of <\/b><a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">You cannot compare your business to another brand and\/or mentioning them. &#8211; “<\/span><i>Do you have an advertisement for your goods or services (including trademarked goods\/services) in which they are compared to those of a competitor? Is one of your competitors comparing your goods\/services to theirs? That is comparative advertising, and it is generally permissible. However, all comparative advertisements must be truthful and must not be deceptive. Truthful comparative advertisements are beneficial to consumers and can help them make good purchasing decisions. In short, if you want to create a comparative advertisement and avoid any pitfalls, be honest, accurate, and truthful.<br \/>\n<span><\/span><br \/>\nComparative advertisements usually highlight measurable characteristics between goods\/services, such as price. However, other metrics can be used, including comparing speed of service, better taste, quality of product, etc. in comparative advertisements.<br \/>\n<span><\/span><br \/>\nComparative advertisements are governed by a variety of regulations and laws. However, the main ones are The Federal Trade Commission Act (FTC Act) and Section 43(a) of the Lanham Act (15 U.S.C. 1125(a) (aka the “Trademark Act”)). Your advertisement may attack or criticize a competitor’s goods\/services as long as your statements are truthful and not deceptive. So, your comparison could be literally true, but it cannot be deceptive. To avoid deceptive comparisons, do not omit facts that may mislead a consumer who then makes a decision based on your misleading statement. Truthful comparative advertisements can help maintain a strong brand in your trademark.<br \/>\n<span><\/span><br \/>\nThere are multiple avenues to take when another company is improperly comparing its goods\/services in a comparative advertisement. Demand letters (including takedown requests) may be sent to both the company with the comparative advertisement and its web hosting provider or outlet where the advertisement is displayed. You may file a complaint with the FTC, but this is usually only beneficial if there is a large amount of consumer harm instead of just a dispute between two competitors. If you have national advertisements and meet certain criteria, you may file a complaint with the National Advertising Division of the Council of Better Business Bureaus, Inc. Finally, you may file a complaint in Federal Court under the Lanham Act (aka the “Trademark Act”). You may be entitled to injunctive relief (to stop the false advertiser from continuing to display the comparative advertisement during the case—and possibly even the display of your trademark) and\/or for monetary damages to be awarded. In general, the party seeking monetary relief must prove that actual consumer deception or confusion occurred due to “material” statements or omissions in the comparative advertisement that caused actual harm.”<\/i><span style=\"font-weight: 400;\"> &#8211;<\/span> <b>Answered by Craig Creeden of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a>\n<\/ol>\n<h4><b>Common Trends &#8211; Ok or Not?<\/b>:<\/h4>\n<ol>\n<li><span style=\"font-weight: 700;\">YouTube Embedded Videos: any issues around this (even if it is commercial in nature)? <\/span><span style=\"font-weight: 400;\">– <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><b><i>Generally no<\/i><\/b><i><span style=\"font-weight: 400;\"> &#8211; Youtube&#8217;s user agreement outlines that pretty much anything uploaded to them is licensed to them. The license also allows YouTube users to embed the videos on their own websites. You can use a YouTube embedded video pretty much anywhere. What you can&#8217;t do is download the video &amp; then re-upload it as your own. That would be copyright infringement and any creative work, you should assume by default, has copyright protection.”<\/span><\/i><span style=\"font-weight: 400;\"> &#8211; <\/span><b>Answered by<\/b> <b>Michael J. Feigin, Esq. of<\/b> <a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b> <\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Blog images: where’s the line for safe\/acceptable use vs infringement? Are blogs any different since they’re often viewed as news\/editorial in nature &amp; somewhat less commercial? <\/span><span style=\"font-weight: 400;\">&#8211; <\/span><i><span style=\"font-weight: 400;\">“At its core, Copyright Law prevents the use or distribution of another&#8217;s copyrighted work absent permission to use the work. However, there is an exception as a defense to a claim of copyright infringement when someone&#8217;s use of another&#8217;s copyrighted work constitutes &#8220;fair use.&#8221; The purpose of allowing for fair use is for situations &#8220;such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research.&#8221; (Section 107 of the Copyright Act). The copyright statute sets out four factors (although courts can consider other factors as well) to consider to determine if a use constitutes fair use. <\/span><\/i><br \/>\n<span><\/span><br \/>\n \t<i><span style=\"font-weight: 400;\">These four factors are:<\/span><\/i><br \/>\n \t1.) <i><span style=\"font-weight: 400;\">the purpose and character of the use, including whether such use is of a commercial nature or is for nonprofit educational purposes;<\/span><\/i><br \/>\n \t2.) <i><span style=\"font-weight: 400;\">the nature of the copyrighted work;<\/span><\/i><br \/>\n \t3.) <i><span style=\"font-weight: 400;\">the amount and substantiality of the portion used in relation to the copyrighted work as a whole; and<\/span><\/i><br \/>\n \t4.) <i><span style=\"font-weight: 400;\">the effect of the use upon the potential market for or value of the copyrighted work. Section 107 of the Copyright Act.<\/span><\/i><br \/>\n<span><\/span><br \/>\n<i><span style=\"font-weight: 400;\">So, it is not a matter of a blog being viewed as news\/editorial in nature and somewhat less commercial as a whole. It would more likely turn on whether the specific post that uses the copyrighted photo without permission constitutes fair use by conducting an analysis of the four factors above. Furthermore, it would likely matter whether the blog as a whole is commercial (i.e. is the blog owner receiving some sort of income from pageviews, etc.). The more the post is for noncommercial educational purposes, news reporting, comment, or criticism, the more likely such use would constitute fair use&#8211;especially regarding commentary of the photo itself and not just general news reporting about some item other than the copyrighted photo. If the use of the copyrighted photo is &#8220;transformative,&#8221; as in adding something new to the photo or arranging the photo in a collage, etc., the more likely the use is fair use. <\/span><\/i><br \/>\n<span><\/span><br \/>\n<i><span style=\"font-weight: 400;\">However, these issues are determined on a case-by-case basis after a detailed analysis. There is no bright-line rule to follow.”<\/span><\/i> <span style=\"font-weight: 400;\">&#8211;<\/span> <b>Answered by Craig Creeden of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Reposting images on social media. Can people just get away with stealing images from everywhere because it’s personal use &amp; there’s typically no commercial interest? How is it different from a business pulling images for social media use? <\/span><span style=\"font-weight: 400;\">&#8211; “<\/span><i><span style=\"font-weight: 400;\">While using a copyrighted image for personal, non-commercial use may be considered fair use, the water gets a little murky when reposting images to social media. When placing a copyrighted image on your social media page, you must be very careful to ensure your post falls within the bounds of fair use. Generally, use of a copyrighted image for purposes of criticism, commentary, news reporting, teaching, scholarship, or research is fair use and not infringement.<\/span><\/i><br \/>\n<span><\/span><br \/>\n<i><span style=\"font-weight: 400;\">In determining whether the use of a work is a fair use, the factors to be considered include: (1) the purpose and character of the use (this requires two distinct considerations: is the use commercial in nature?, and is the use “transformative”? —that is does it incorporate the copyrighted work into a new work that no longer resembles the original (usually done by adding new expression or commentary)); (2) the nature of the copyrighted work (i.e. is the copyrighted image a non-fictional rendering or a highly creative work?); (3) the amount and substantiality of the portion used in relation to the copyrighted work as a whole (i.e. are you just using a small portion of the image?); and (4) the effect of the use upon the potential market for or value of the copyrighted work (i.e. will your use take away from or diminish the value of the copyrighted image?). <\/span><\/i><br \/>\n<span><\/span><br \/>\n<i><span style=\"font-weight: 400;\">While the use of an image in a personal social media post may often be considered non-commercial, commentary, criticism, or transformative, this is not always the case when it comes to social media posts made by businesses or entrepreneurs.<\/span><\/i><br \/>\n<span><\/span><br \/>\n<i><span style=\"font-weight: 400;\">For example, on September 11, 2013, a production assistant for the Fox News program Justice with Judge Jeanine posted the iconic photo of three firefighters raising the American flag near the ruins of the World Trade Center after the 9\/11 bombings (the “Work”) on the program’s social media page. The Work was captured by the photojournalist Thomas E. Franklin. Fox News did not simply post a blanket copy of the Work. The image used by Fox News was different from the Work in five distinct ways. Fox News used a (1) cropped, (2) lower-resolution version of the Work, (3) which was juxtaposed with Raising the Flag on Iwo Jima and (4) in a smaller scale than the Work, and (5) added the phrase “#neverforget.” The photographer sued for copyright infringement and Fox News claimed fair use, arguing the posting on social media was by its nature transformative because such posting can be categorized as comment, was meant to connote remembrance and participation in a global discussion of the events of 9\/11, and used a derivative image that combined the Work with Raising the Flag on Iwo Jima. The district court rejected the argument and held that the posting was not a fair use. In so holding, the district court noted the Work was the predominant feature of the post; the image used by Fox News altered the content and message of the Work, but only minimally; and the court questioned whether the commentary Fox News wished to convey (i.e. #neverforget) created anything new or transformative. The court also found that a question existed as to whether Fox News made the post for the purely expressive purpose of commenting on the events of September 11, 2001, or whether it did so for the commercial purpose of promoting the Justice with Judge Jeanine program. Based on the above, the district court found that the social media post was not fair use. North Jersey Media Group Inc. v. Jeanine Pirro and Fox News Network, LLC, 74 F.Supp.3d 605 (S.D.N.Y. 2015).<\/span><\/i><br \/>\n<span><\/span><br \/>\n<i><span style=\"font-weight: 400;\">Therefore, when posting an image to social media you should consider all four fair use factors, particularly whether your post transforms the original image and whether the post can be considered commercial in nature. If in doubt, the best practice and general rule of thumb when using copyrighted works is to obtain permission from the rights owner prior to your use. Claiming that its just Facebook, Instagram, Twitter, or another social media outlet is not a legal defense to copyright infringement.”<\/span><\/i> <span style=\"font-weight: 400;\">&#8211;<\/span> <b>Answered by Kaitlyn Haase of<\/b> <a href=\"http:\/\/lilenfeldpc.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Lilenfeld PC<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><span style=\"font-weight: 700;\">Are there any instances of logo reproduction that you do not need permission for? I see a few things happen often, a couple of which are: showing a company logo on your website when you’ve done work for the company (obviously not in a case where a nondisclosure agreement was in place)? Or, you have been featured on a website, written for them or mentioned on their site (as in the “as seen on” trend)? <\/span><b><i>”Generally you’re ok if you use no more than you have to and you’re truthful.<\/i><\/b><i><span style=\"font-weight: 400;\"> So, if you do work for a company, you can truthfully say that. If you’re using the logo, that’s getting closer to being a problem. That’s starting to look like an endorsement since it’s more than you need to say what you need to say. This is also a great way of losing clients. I advise my graphic design clients to spell out in their contracts what they can do. I’ve only had one company not want someone to use their work in their portfolio and that was because the business itself was a design company and wanted people to assume they made their own logo. Same thing goes if you’ve been mentioned in an article, you don’t need to have a contract drawn up, or really even ask permission, just tell your contact that you’re going to mention how and where you were featured and you’re going to use their logo in your “about me” page or wherever. Sometimes they’ll tell you not to use the logo, in which case…keep them happy and not use the logo.”<\/span><\/i> <b>– Answered by Steve O’Donnell of<\/b> <a href=\"http:\/\/3cpatents.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>3C Patents<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<h3><b>Examples of real life intellectual property issues (from IP lawyers) that will make you think more seriously about how copyright &amp; IP laws apply to you.<\/b><\/h3>\n<ol>\n<li><i><span style=\"font-weight: 400;\">“A client of a client had an &#8220;I love New York&#8221; Bracelet for sale in his store and was arrested for “trademark counterfeiting”. You can&#8217;t typically have someone arrested for a trademark violation but the State of New York apparently does this with their own trademark. This person ended up pleading guilty before I made it to court to defend him and received a criminal record and small fine over the &#8220;I love New York&#8221; jewelry. He was apparently caught by an inspector perusing stores in New York City for such things”<\/span><\/i><span style=\"font-weight: 400;\">. &#8211; Provided <\/span><span style=\"font-weight: 400;\">by <\/span><b>Michael J. Feigin, Esq. of <\/b><a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><i><span style=\"font-weight: 400;\">“In another case, some immigrants who&#8217;d only been in the country for a short time were selling knock-off jewelry with a specific symbol on them belonging to another company. This company hired an expensive law firm to go after them over the necklace they were selling. The immigrant&#8217;s attorney talked the company down to a zero dollar settlement &amp; they agreed they wouldn’t do it again. The violating party lucked out that they didn’t want to make an example. Often, companies will try to set an example &amp; it could end up costing 20-30k+ fees &amp; fines.”<\/span><\/i> <span style=\"font-weight: 400;\">&#8211; Provided <\/span><span style=\"font-weight: 400;\">by <\/span><b>Michael J. Feigin, Esq. of <\/b><a href=\"https:\/\/www.patentlawny.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>Feigin &amp; Fridman<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><i><span style=\"font-weight: 400;\">“I had someone use a couple Attribution CC licensed photos in his blog posts. The photos were CC licensed as a sort of advertising for the stock photo site so they wanted attribution to drive more visitors to their site. The blogger didn’t give attribution. Now the stock photo site is threatening a lawsuit if he doesn’t pay a couple thousand for each photo he used without giving attribution.”<\/span><\/i> <b>– Provided by Steve O’Donnell of<\/b> <a href=\"http:\/\/3cpatents.com\/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><b>3C Patents<\/b><\/a><\/li>\n<p><span><\/span><\/p>\n<li><i><span style=\"font-weight: 400;\">“One area of copyright law that is unfamiliar to the general population and attorneys alike is that of Copyright Management Information under the Digital Millennium Copyright Act, which is information that identifies, inter alia, the owner of the work, terms and conditions for using the work, and other, helpful information. This section of the law creates a cause of action if a person without authority, inter alia, removes or alters this information. For example, in a cringeworthy situation we’ve seen, a professional photograph available online may identify the owner of the work at the bottom righthand corner of the work. If a person, without authority, removes this information and uploads a copy of the photograph to his or her website for sale to others, that same person may not have only exposed himself or herself to a claim for copyright infringement, but may now have exposed himself or herself to a completely different section of the Copyright Act for statutory damages ranging from $200.00 to $2,500.00. As such, it’s important to be mindful of cropping photographs and other protected works to remove the identity of a copyright owner.”<\/span><\/i> <b>– Provided by Robert Powers of<\/b> <a href=\"https:\/\/www.mcplegal.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>McClanahan Powers, PLLC<\/b><\/a><\/li>\n<\/ol>\n<h2><b>In Conclusion: Marketers… Don’t Be Lazy, It Will Likely Come Back To Bite You.<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">If you’re thinking that using an image here &amp; there for a website shouldn’t be problematic, think again. It’s unlikely that you’ll end up documenting every single image you use &amp; where it came from. So by the time this becomes an issue, the images you used that were questionable as to copyright status, will be mixed in where you will no longer remember. Then a year or two (maybe longer) down the road when a copyright holder contacts the site owner, demanding money and the quality of your work comes into question, it will dawn on you why this is so problematic. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Now, there’s the question of who <\/span><i><span style=\"font-weight: 400;\">really<\/span><\/i><span style=\"font-weight: 400;\"> is responsible for the work. While legally, it probably falls on the business\/site owner, if <\/span><i><span style=\"font-weight: 400;\">you<\/span><\/i><span style=\"font-weight: 400;\"> don’t fix the issue now, you will likely burn any bridges with this client right to the ground. At this point, that happy client who may have sent you business or gave you a good review\/testimonial becomes a very angry client (and for good reason, they hired you to be the professional). So now, you’re faced with potentially paying the fee being demanded by the copyright holder as well as living with the knowledge that there’s a big can of worms which is wide open. That can of worms is the other images on the website that you weren’t worried about at the time you posted them. By now, you probably no longer remember which is which. Now comes the fun part: backtracking all the work you’ve done in relation to images on this site. All which could have been avoided by making sure you’re using images which have a copyright status appropriate for your desired use.<\/span><\/p>\n<style>\nimg{max-width: 100%; height: auto;}\n<\/style>\n","protected":false},"excerpt":{"rendered":"<p>When I’m trying to come up with ideas for content development, I like to let Google autocomplete variations of phrases with keywords related to my subject matter. Doing this helps me understand the types of questions people are searching for regarding a particular topic. This is also a great way to develop FAQ content ideas &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The Marketer’s Guide to Navigating Copyrights For Image Usage&#8221;<\/span><\/a><\/p>\n","protected":false},"author":4,"featured_media":5862,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[118,108],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Marketer’s Guide to Navigating Copyrights For Image Usage - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Marketer’s Guide to Navigating Copyrights For Image Usage - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"When I’m trying to come up with ideas for content development, I like to let Google autocomplete variations of phrases with keywords related to my subject matter. Doing this helps me understand the types of questions people are searching for regarding a particular topic. This is also a great way to develop FAQ content ideas &hellip; Continue reading &quot;The Marketer’s Guide to Navigating Copyrights For Image Usage&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2018-07-30T08:10:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-25T16:18:05+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"667\" \/>\n\t<meta property=\"og:image:height\" content=\"500\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ryan Amen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"34 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg\",\"contentUrl\":\"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg\",\"width\":667,\"height\":500},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/\",\"name\":\"The Marketer\\u2019s Guide to Navigating Copyrights For Image Usage - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#primaryimage\"},\"datePublished\":\"2018-07-30T08:10:37+00:00\",\"dateModified\":\"2021-05-25T16:18:05+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The Marketer\\u2019s Guide to Navigating Copyrights For Image Usage\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829\",\"name\":\"Ryan Amen\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g\",\"caption\":\"Ryan Amen\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Marketer’s Guide to Navigating Copyrights For Image Usage - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/","og_locale":"en_US","og_type":"article","og_title":"The Marketer’s Guide to Navigating Copyrights For Image Usage - Nifty Marketing","og_description":"When I’m trying to come up with ideas for content development, I like to let Google autocomplete variations of phrases with keywords related to my subject matter. Doing this helps me understand the types of questions people are searching for regarding a particular topic. This is also a great way to develop FAQ content ideas &hellip; Continue reading \"The Marketer’s Guide to Navigating Copyrights For Image Usage\"","og_url":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2018-07-30T08:10:37+00:00","article_modified_time":"2021-05-25T16:18:05+00:00","og_image":[{"width":667,"height":500,"url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg","path":"\/nas\/content\/live\/niftymarketing\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg","size":"full","id":5862,"alt":"","pixels":333500,"type":"image\/jpeg"}],"twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"Ryan Amen","Est. reading time":"34 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#primaryimage","inLanguage":"en-US","url":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg","contentUrl":"https:\/\/niftymarketing.com\/wp-content\/uploads\/2018\/07\/Understanding-Copyrights.jpg","width":667,"height":500},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#webpage","url":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/","name":"The Marketer’s Guide to Navigating Copyrights For Image Usage - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#primaryimage"},"datePublished":"2018-07-30T08:10:37+00:00","dateModified":"2021-05-25T16:18:05+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/the-marketers-guide-to-navigating-copyrights-for-image-usage\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"The Marketer’s Guide to Navigating Copyrights For Image Usage"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/bd0e8c6cb905e2ff3e30f31277379829","name":"Ryan Amen","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9936b7d75acc6ab77d6ebcaa0d579948?s=96&d=mm&r=g","caption":"Ryan Amen"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/5641"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=5641"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/5641\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media\/5862"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=5641"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=5641"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=5641"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}