{"id":566,"date":"2010-04-07T08:34:30","date_gmt":"2010-04-07T08:34:30","guid":{"rendered":"https:\/\/niftymarketing.com\/?p=566"},"modified":"2018-04-05T17:38:35","modified_gmt":"2018-04-05T17:38:35","slug":"local-search-talk-series-part-4-chris-silver-smith-interview","status":"publish","type":"post","link":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/","title":{"rendered":"Local Search Talk Series Part 4: Chris Silver Smith Interview"},"content":{"rendered":"<p>Next up on our local search talk series is <a href=\"http:\/\/silvery.com\/\">Chris Silver Smith<\/a>. He has consistently put out some of the <a href=\"http:\/\/silvery.com\/articles.htm\">best information on local search I have read to date<\/a>. Chris has served as the  Head of the Technology &amp; Advanced Development Department of Verizon (Superpages.com), and currently is the Director of Optimization Strategies for <a href=\"http:\/\/www.keyrelevance.com\">KeyRelevance<\/a>. Just recently, he launched a new blog called <a href=\"http:\/\/www.nodalbits.com\/\">Nodal Bits<\/a>, which is bound to be a fantastic resource for anyone in the local space.<!--more--><\/p>\n<p><strong>How did you initially get involved with internet marketing?<\/strong><\/p>\n<p>While working for Superpages.com back in 1996\/1997, I was promoted to work as an analyst for the site, assisting <a href=\"http:\/\/www.linkedin.com\/in\/kingrum\">Kelly Ingrum<\/a>. Among other technical stuff, this entailed assembling our logfile statistics on site usage and providing reports to others throughout the company. While working in that role, <a href=\"http:\/\/www.linkedin.com\/pub\/patricia-clark\/3\/1b1\/738\">Patricia Clark<\/a>, one of our business development mavens, asked me to look into ways by which we could increase our organic site traffic, thus reducing some dependence upon major partnerships. After observing that a lot of our traffic was entering the site on pages other than the homepage, I got permission to conduct a limited-scope experiment to see if it&#8217;d be possible to expand on that behavioral tendency. I built around 100 pages to target yellow pages categories and\/or geographic locations. While each page received relatively low traffic, it was quickly apparent that expanding on this concept would result in simply astonishing amounts of traffic &#8212; when you start multiplying the dribble of traffic by roughly 15K business categories and 32K cities, the traffic would obviously be substantial.<\/p>\n<p>Eventually, my research report finally came to the attention of some of the top executives in the company, and I was given permission to update my research and deploy a limited-scope treatment of this concept in a lesser section of the site. Once that was shown to work really well, I was essentially given carte blanche to execute fully in the main sections of the site, and this really blew the roof off. Shortly after, the company deployed a pay-per-click ad product, so it was very easy to connect the dots between revenues that came as a result of my initiatives.<\/p>\n<p>My role had expanded by this time &#8212; I had been promoted to Manager of Technology overseeing a small team of developers, and after the SEO program matured, I was eventually promoted to be head of the Technology Department. My projects weren&#8217;t solely SEO &#8211; there were a great many other things I worked upon as well, including mapping, content expansion, data quality, apps, PPC integrations, etc. But, by this time I saw that most public-facing internet projects can and should have an SEO component, just as much as they should include usability testing, branding concerns, legal check-offs, good security, etc.<\/p>\n<p><strong>What made you loco for local?<\/strong><\/p>\n<p>Hmmm&#8230; I guess that there&#8217;s something of the &#8220;jack-of-all-trades&#8221; about my personality which makes local tech appealing. I was a cartographer prior to the internet really catching fire, and some of that background experience stuck with me &#8212; and, I&#8217;ve always found puzzles to be highly appealing. Local search provides a heady mixture with enough change and complexity to constantly challenge me and fascinate me.<\/p>\n<p><strong>Do you have someone who has helped you along the way in learning local?<\/strong><\/p>\n<p>I owe much to gobs of people who&#8217;ve helped me out! Before the internet as we know it, I had an extremely cutting-edge professor at school, <a href=\"http:\/\/archone.tamu.edu\/architecture\/faculty\/larsen\/mainframe.html\">Terry Larsen<\/a>, who not only taught us hypertext, but also taught me programming in C (which paved the way for me to self-learn programming in JavaScript, PHP, Perl, Python and Java). I learned quite a bit about maps way back when I worked for TAMU Geography Department Head, <a href=\"http:\/\/geoweb.tamu.edu\/profile\/RGiardino\">Dr. Rick Giardino<\/a>. I think I learned beginings of corporate etiquette and some good design techniques from <a href=\"http:\/\/www.linkedin.com\/in\/bradsims\">Brad Sims<\/a> when he hired me on at GTE Superpages. I learned all the ins and outs of internet metrics from Kelly Ingrum, mentioned previously. As a designer\/programmer, I learned a ton about Usability from <a href=\"http:\/\/www.linkedin.com\/in\/demetrioskaris\">Dr. Demetrios Karis<\/a> at Verizon along with his team, and I was mentored quite a lot about leadership and corporate etiquette by <a href=\"http:\/\/www.linkedin.com\/in\/zumster\">Doug Heatherly<\/a>, Technology Director at Superpages.<\/p>\n<p>I learned quite a lot about SEO and Search Engine Marketing from <a href=\"http:\/\/daggle.com\/\">Danny Sullivan<\/a> and <a href=\"http:\/\/searchwise.net\/\">Chris Sherman<\/a>, one way or another. Not only did I read <a href=\"http:\/\/searchenginewatch.com\">SearchEngineWatch.com<\/a> from the earliest days, but the conferences they hosted were also means by which I learned more of the ropes beyond my own research.<\/p>\n<p>Finally, while I initially hired <a href=\"http:\/\/www.stephanspencer.com\/\">Stephan Spencer<\/a> to audit my SEO work at Superpages, I ended up learning more and more from him by exposure. He encouraged me to contribute to <a href=\"http:\/\/naturalsearchblog.com\">NaturalSearchBlog.com<\/a>, which opened more doors than I ever imagined, and he eventually hired me to work in his agency.<\/p>\n<p>There are many others from whom I&#8217;ve learned a lot along the way.<\/p>\n<p>Now, it may seem odd that I&#8217;ve listed relatively few people that are local-centric experts, but I think the takeaway from this is that all of these people were vital to empowering me to grow &#8212; and without their encouragement and mentoring I don&#8217;t think I would&#8217;ve had the fertile ground necessary to focus on the things that fascinate me.<\/p>\n<p><strong>Can you explain your roll at  Key Relevance as the Director of Optimization Strategies. What do you spend your time doing?<\/strong><\/p>\n<p>We&#8217;re a &#8220;boutique&#8221; search marketing agency, which means that we customize for each client&#8217;s needs. The founders, <a href=\"http:\/\/www.keyrelevance.com\/about.htm\">Mike &amp; Christine Churchill<\/a>, are really unique in that they want to focus on doing very high-quality work for clients with top-skilled staff. We primarily work to provide our clients with consulting advice, recommending the best ways to promote themselves on the internet, but as a member of a small agency, I&#8217;m not above &#8220;getting my hands dirty&#8221; with the nitty-gritty details of projects. I spend a lot of time working to stay current on alterations in the search algorithms (did you know that Google stated recently that they made over 500 &#8220;tweaks&#8221; to their search algorithm last year?), and I do some experimentation as well. A larger portion of my time goes towards optimization activities on behalf of my clients.<\/p>\n<p>Oops &#8211; I&#8217;ve gone and written vague and obscure things &#8211; I&#8217;d better elaborate or I&#8217;ll sound like a politician!  To be specific, I do a lot of various things myself on behalf of clients, including: write recommendation papers for strategic approaches to specific marketing channels such as Twitter, Facebook, MySpace, Blog Search, Google Maps, Google Images; custom-develop widget applications; provide SEO &amp; Usability analyses of websites; vet new product concepts; provide intervention in reputation management issues; optimize business profiles in Google Maps, IYPs and online directories; perform Social Media optimization, including setting up automated tweets and status updates; develop custom maps and geocode address lists; and provide analytic reports from various sources.<\/p>\n<p>This isn&#8217;t an exhaustive list &#8212; and we do have various other personal who I tap to assist with various projects, too. We juggle duties somewhat, based upon each of our individual skillsets &#8212; I might get advice on how to do a particular thing that I&#8217;m less-experienced with (for instance, Mike is King of regular expressions &#8211; faster to ask him than to bumble my own, less-efficient expression).<\/p>\n<p><strong>What are some untapped areas online that you think Small Business Owners could go the extra mile by focusing on?<\/strong><\/p>\n<p>There&#8217;s often too much focus on less-important aspects of SMB website design. For instance, making a too-splashy, graphic-intensive website at the expense of good on-page text and SEO structure &#8212; yes, visual design is an important element, but it is worthless if you create a site in such a way that few-to-no people will see the pretty pix! Further, focusing on Usability and the Consumer Experience more than immitating a competitor will accomplish more &#8212; does the site have the basic info that a consumer would want to see when landing there after searching in a search engine? A site typically should answer basic questions in an accessible manner: who owns the business; where is it located; what is the phone number; what products\/services are offered; what are the hours of operation; how much will it cost; and are there notable other customers or testimonials?<\/p>\n<p>For instance, in this day and age, there&#8217;s simply no excuse for a restaurant website to have a menu without prices! As a consumer, whenever I encounter that, it makes me mad.<\/p>\n<p>Since consumer experience is so important, and since Google focuses on Usability factors, I particularly highlighted a number of key website elements at SMX including employee profiles, formatting of phone numbers, testimonials, etc. I think it&#8217;s naive to think that Google will not use some of these elements as factors for assessing relative website quality.<\/p>\n<p>SEO is becoming less about technical tricks and tweaks and more about good usability paired with &#8220;classic&#8221; promotion activities.<\/p>\n<p><strong>You have spoken about the steps that IYP’s could take to be “saved”. Do you see any IYP’s starting to heed the advice.<\/strong><\/p>\n<p>I have consulted for a few top IYPs, so I happen to know that a number of them are working very hard to be competitive. In SEO terms, I see a number of them have been working to step up their games.<\/p>\n<p>I&#8217;m unhappy to say that I think there&#8217;s still an element of hubris associated with some in the YP and IYP industry. Directly after my article on <a href=\"http:\/\/searchengineland.com\/what-can-save-yellow-pages-industry-15808\">ten things which could save the yellow pages<\/a>, I heard remarks from a couple of different top companies that &#8220;they were already doing these things&#8221;. I don&#8217;t believe enough of them have done enough of the items, nor gone far enough in doing them.<\/p>\n<p>It&#8217;s probably about time that I write another article on the subject which pushes further. The earlier consensus among many in the industry (of those who agreed that the lifespan of print may be limited) had been that these companies might survive in an online incarnation which eventually replaces print directories. I&#8217;m not so certain of this any more. The local online space has been very fractured heretofore, but I see some indications that consumer behavior is gravitating towards fewer providers.<\/p>\n<p><strong>Speaking of IYP’s, what are the 3 top lessons you learned while heading up <a href=\"http:\/\/superpages.com\">Superpages.com<\/a>’s SEO work<\/strong>?<\/p>\n<p>Only 3?!? I&#8217;d say:<\/p>\n<p>1. <strong>Bypass roadblocks<\/strong>. Biggest impediments of doing good SEO are inflexible infrastructure and bureaucratic project management development processes. If the infrastructure and embedded project management process keep you from making relatively simple changes for on-page SEO signals, you need to ditch them and find a way around them (at least temporarily). Money this year is always better than money next year!<\/p>\n<p>2. <strong>Take the low-hanging fruit first<\/strong>. Is there a simple change that beneficially effects a maximum number of pages on your site? Do that one first. Changes which affect many pages will give you greater profit than a change which affects only one page.<\/p>\n<p>3. <strong>Educate, empower and acknowledge your colleagues<\/strong>. (Hah! I snuck a few tips into one!) Essentially, educating others on the basics of good SEO will help them to bake it into everything they&#8217;re doing upfront, and acknowledging others&#8217; work gives people incentive to do a good job without necessitating your involvement. Don&#8217;t try to take credit for everything and give credit where credit&#8217;s due.<\/p>\n<p><strong>I know you spend a lot of time with Google Maps, Are you spending much time with Bing Local?<\/strong><\/p>\n<p>I&#8217;ve recently begun to shift some of my time to Bing&#8217;s local stuff more &#8212; expect to see some articles from me about it.<\/p>\n<p><strong>What immediate change would you like to see Google make to their local listings (asked before Google&#8217;s new service location announcement)?<\/strong><\/p>\n<p>I feel like a broken record when I harp on the issues around businesses which have no local street address, and businesses which offer services to multiple cities within major metro areas. At the SMX West, Google&#8217;s Carter Maslan told all of us local search marketers to &#8220;almost hold your breath&#8221; &#8212; that Google Maps is close to deploying a solution for this. So, maybe that key need will be fulfilled soon!<\/p>\n<p><strong>What do you do in your free time&#8230;if you have any?<\/strong><\/p>\n<p>I cook dinner for my girlfriend, and I also work on this ridiculously complex project &#8212; I&#8217;m publishing a &#8220;A Comprehensive Dual Bibliography of James P. Blaylock &amp; Tim Powers&#8221;, two fantasy authors, and I&#8217;m binding the books myself. The binding work has just about eaten my lunch and taken way too long, but it&#8217;s very therapeutic to work upon an antique, manual craft.<\/p>\n<p><strong>You recently had a great local search experience finding an emergency surgeon. Do you mind sharing the story, and any local search after thoughts?<\/strong><\/p>\n<p>Argh! That story could very nearly be an article all on its own! The quick version of the story is that I had a couple of fillings put in back in December, and one went bad the weekend prior to me flying out to Santa Clara for SMX West. I saw my dentist that Monday morning and we mutually felt that antibiotics and analgesics might keep the toothache under control long enough for me to speak at both SMX West and SEMpdx SearchFest, but a couple of days into SMX and the infection seemed to be spreading &#8212; my check, jaw and neck became swollen. Also, I was barely able to keep my sanity since the analgesics were not strong enough to deal with the pain by this point. Swelling actually began to impede my ability to speak, and I was only able to open my mouth very slightly before it was over.<\/p>\n<p>The last day of SMX, I spoke on the Twitter panel, then left early to go hunt down an endodontist (I needed a root canal). I have an allergy to some component of local anesthetics, so I could not find an endodontist willing to fix me up.<\/p>\n<p>I used Google Maps to locate promising-looking endodontists, and it did help me find neighborhoods where some of the better dentistry businesses seem to congregate. I opted to just drop in on the assumption that I could appeal to doctors&#8217; pity and see them without an appointment.<\/p>\n<p>After seeing two really good endodontists who both told me I should first see an allergist to figure out what ingredient in the anesthetics I was allergic to, and both were certain that I would not find an endodontist who could do full anesthesia, I was ready to throw in the towel and slink back to Dallas to find help. But, by this time I was too late to get a flight back, and I was afraid the infection could spread to my jawbone or bloodstream if I had to delay much more (not to mention, I wasn&#8217;t all that sure I could handle a multi-hour flight with the pain and possible bizarreness of changing air pressure).<\/p>\n<p>I finally located an oral surgeon who I felt was well-educated and experienced enough to deal with my needs. I was specifically searching in Google Maps for someone who was skilled with anesthesia &#8212; I happen to know it&#8217;s not uncommon for dentists to damage patients with anesthesia, so I was looking for someone who had background training and equipment to do it right. I needed full anesthesia for either a root canal or a tooth extraction, since I can&#8217;t use the local anesthetic. I&#8217;ve read in the past that if an office does not have blood-oxygen level monitoring equipment, it&#8217;s more likely for them to over-medicate a patient, which can result in neurological damage or even death.<\/p>\n<p>The surgeon I located was <a href=\"http:\/\/www.drfollmar.com\">Dr. Kenneth Follmar II, located in Los Gatos<\/a>. He&#8217;s a 2nd-generation oral surgeon, I found by researching on the internet. His website listed his education, background experience, and hospital affiliations. (Note that he not only has a DDS and BS in Biology, but he also has a Pharmacological degree, did a residency in Anesthiology, and is board-certified in Anesthiology. Really outstanding chops for an oral surgeon! That kind of background showed me someone with a passion for his career, as opposed to someone who merely does the minimum to get by in a high-salary profession.)<\/p>\n<p>Further, his website indicated the staff included an RN, they were certified in CPR, and that they used oxygen monitors during surgery. Check! His site stated that a titrated dose of anesthetic would be administered &#8212; it&#8217;s pretty geeky of me, but I happened to know that this meant an extremely precise measurement would be used &#8212; in other words, just enough anesthetic, reducing the chances of getting over-medicated.<\/p>\n<p>Best of all, they returned my call that night to their answering service, AND agreed to perform a tooth extraction for me the very next morning! How fantastic is that?!?<\/p>\n<p>The surgery was rapid, I was treated well, and was taken care of by friends in Silicon Valley over the weekend. I recovered just enough by Monday morning to fly on to speak at Portland&#8217;s SearchFest. It may be a relatively minor oral surgery, but my infection was not minor, and my circumstances felt pretty extreme at the time.<\/p>\n<p>Local search was only marginally helpful to me in locating Dr. Follmar. You can see that his website is very simply assembled. I&#8217;m lucky that they used the terminology in text on the site&#8217;s pages for which I was searching. I&#8217;m admittedly a bit anomalous compared to other consumers, considering what I was searching upon. He doesn&#8217;t have all perfect online user ratings, too &#8212; the only negative ones seemed to be around rudeness, which I cannot believe after dealing with his office. Even so, those negative reviews obviously didn&#8217;t stop me from selecting him &#8212; not only do I focus more on skills and experience in medical service providers, but the couple of negatives helped to show that all of his reviews were not merely from paid shills.<\/p>\n<p>Could his site and online presence be improved? Absolutely. I&#8217;m so grateful to him that you can bet I&#8217;m going to give him solid-gold ratings everywhere online and provide him with some free advice on optimization as a heart-felt thank-you! But, ultimately I wonder whether he really needs it. I think that oral surgeons typically get more business-to-business referrals, directly from other dentists and doctors. Most individuals do not search-for nor go directly to an oral surgeon &#8212; they are sent by their existing providers.<\/p>\n<p><strong>In your opinion, what do you think is the biggest challenge facing local online?<\/strong><\/p>\n<p>The biggest challenge seems to be in terms of reducing competition that results in fewer options for local promotion. Google&#8217;s increasing marketshare tends to reduce options for SMBs. In the past, if you didn&#8217;t rank well in Google, you could still rank in Yahoo, MSN, Superpages, Yellowpages.com, Yellowbook, Citysearch, AOL YP, etc. If marketshare continues to shift to Google and Google Maps, it seems like small businesses&#8217; options may also erode.<\/p>\n<p>But, Social Media like Twitter and Facebook, the fragmentation of mobile search, along with competitive pushes by Bing Local &#8212; all these emerging areas give us hope that there will continue to be some diversification of promotional channels.<\/p>\n<p><strong>Can you give us an idea of what you think 2010-2011 hold in store for local search?<\/strong><\/p>\n<p>New options for promotion via Social Media. I&#8217;m limited by NDAs to relate specifics, but I&#8217;ve been consulted on a few different exciting products which will be emerging soon that will provide new options for small businesses to better market themselves via social media channels.<\/p>\n<p><strong>What is the best advice you would give someone that is wanting to learn about local seo?<\/strong><\/p>\n<p>For a fast primer on local seo, read David Mihm&#8217;s &#8220;<a href=\"http:\/\/www.davidmihm.com\/local-search-ranking-factors.shtml\">Local Search Ranking Factors<\/a>&#8221; survey and the blogs and articles by each of the contributors. Also, read <a href=\"http:\/\/www.netmagellan.com\">Ash Nallawalla&#8217;s blog<\/a>, and the <a href=\"http:\/\/google-latlong.blogspot.com\/\">Google Lat Long blog<\/a>.<\/p>\n<p><strong>Well, Thank you Chris for taking the time to do this interview. You really shared some great information for newbies and oldbies and I look forward to keeping up with the amazing content that you continue to put out.<\/strong><\/p>\n<p>If you are new to the local search talk series make sure you check out these other great interviews!<\/p>\n<ul>\n<li><a href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-1-miriam-ellis-interview\">Interview with Miriam Ellis<\/a><\/li>\n<li><a href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-2-dev-basu-interview\">Interview with Dev Basu<\/a><\/li>\n<li><a href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-3-matt-mcgee-interview\">Interview with Matt Mcgee<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Next up on our local search talk series is Chris Silver Smith. He has consistently put out some of the best information on local search I have read to date. Chris has served as the  Head of the Technology &amp; Advanced Development Department of Verizon (Superpages.com), and currently is the Director of Optimization Strategies for KeyRelevance. Just &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;Local Search Talk Series Part 4: Chris Silver Smith Interview&#8221;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[52],"tags":[112],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Local Search Talk Series Part 4: Chris Silver Smith Interview - Nifty Marketing<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Local Search Talk Series Part 4: Chris Silver Smith Interview - Nifty Marketing\" \/>\n<meta property=\"og:description\" content=\"Next up on our local search talk series is Chris Silver Smith. He has consistently put out some of the best information on local search I have read to date. Chris has served as the  Head of the Technology &amp; Advanced Development Department of Verizon (Superpages.com), and currently is the Director of Optimization Strategies for KeyRelevance. Just &hellip; Continue reading &quot;Local Search Talk Series Part 4: Chris Silver Smith Interview&quot;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/\" \/>\n<meta property=\"og:site_name\" content=\"Nifty Marketing\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/niftymarketing\" \/>\n<meta property=\"article:published_time\" content=\"2010-04-07T08:34:30+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-04-05T17:38:35+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:creator\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:site\" content=\"@niftymarketing\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mike Ramsey\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"17 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/niftymarketing.com\/#website\",\"url\":\"https:\/\/niftymarketing.com\/\",\"name\":\"Nifty Marketing\",\"description\":\"We Make Law Sexy\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/niftymarketing.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/#webpage\",\"url\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/\",\"name\":\"Local Search Talk Series Part 4: Chris Silver Smith Interview - Nifty Marketing\",\"isPartOf\":{\"@id\":\"https:\/\/niftymarketing.com\/#website\"},\"datePublished\":\"2010-04-07T08:34:30+00:00\",\"dateModified\":\"2018-04-05T17:38:35+00:00\",\"author\":{\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76\"},\"breadcrumb\":{\"@id\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/niftymarketing.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Local Search Talk Series Part 4: Chris Silver Smith Interview\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76\",\"name\":\"Mike Ramsey\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/niftymarketing.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g\",\"caption\":\"Mike Ramsey\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Local Search Talk Series Part 4: Chris Silver Smith Interview - Nifty Marketing","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/","og_locale":"en_US","og_type":"article","og_title":"Local Search Talk Series Part 4: Chris Silver Smith Interview - Nifty Marketing","og_description":"Next up on our local search talk series is Chris Silver Smith. He has consistently put out some of the best information on local search I have read to date. Chris has served as the  Head of the Technology &amp; Advanced Development Department of Verizon (Superpages.com), and currently is the Director of Optimization Strategies for KeyRelevance. Just &hellip; Continue reading \"Local Search Talk Series Part 4: Chris Silver Smith Interview\"","og_url":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/","og_site_name":"Nifty Marketing","article_publisher":"https:\/\/www.facebook.com\/niftymarketing","article_published_time":"2010-04-07T08:34:30+00:00","article_modified_time":"2018-04-05T17:38:35+00:00","twitter_card":"summary","twitter_creator":"@niftymarketing","twitter_site":"@niftymarketing","twitter_misc":{"Written by":"Mike Ramsey","Est. reading time":"17 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/niftymarketing.com\/#website","url":"https:\/\/niftymarketing.com\/","name":"Nifty Marketing","description":"We Make Law Sexy","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/niftymarketing.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/#webpage","url":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/","name":"Local Search Talk Series Part 4: Chris Silver Smith Interview - Nifty Marketing","isPartOf":{"@id":"https:\/\/niftymarketing.com\/#website"},"datePublished":"2010-04-07T08:34:30+00:00","dateModified":"2018-04-05T17:38:35+00:00","author":{"@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76"},"breadcrumb":{"@id":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/niftymarketing.com\/local-search-talk-series-part-4-chris-silver-smith-interview\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/niftymarketing.com\/"},{"@type":"ListItem","position":2,"name":"Local Search Talk Series Part 4: Chris Silver Smith Interview"}]},{"@type":"Person","@id":"https:\/\/niftymarketing.com\/#\/schema\/person\/4638b5009ca5cfa5f5eeb514464f7f76","name":"Mike Ramsey","image":{"@type":"ImageObject","@id":"https:\/\/niftymarketing.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7cf28bb426d1f902dcefc40ab7898181?s=96&d=mm&r=g","caption":"Mike Ramsey"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/566"}],"collection":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/comments?post=566"}],"version-history":[{"count":0,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/posts\/566\/revisions"}],"wp:attachment":[{"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/media?parent=566"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/categories?post=566"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/niftymarketing.com\/wp-json\/wp\/v2\/tags?post=566"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}